{
   "african fan palm": {
      "Description": "A straight tall palm to 20 m with a swollen bole.", 
      "Ecology": "Widespread throughout the dry areas of tropical Africa but only where the watertable is high. It is usually found in sandy well- drained soil, sometimes coastal or at lower altitudes, often in dense stands. In Uganda common in flood plains along rivers Semliki and Kafu, also in Palabek County of Kitgum District, 0-1,200 m. ",
      "Names": {
         "English_Name": "African fan palm",
         "Primary_Name": "African Fan Palm", 
         "Scientific_Name": "Borassus aethiopum", 
         "Ugandan_Name": "Katuugo"
      }, 
      "Parts": {
         "Bark": "smooth grey, thickened above the middle, dead leaves remain on the young trunk, old trunks up to 80 cm across.", 
         "Flower": "male and female on different trees, male producing branched spikes up to 2 m carrying the pollen.", 
         "Fruit": "large, in bunches, round up to 15 cm diameter, orange- brown, cupped in the enlarged calyx, fibrous oily pulp around 3 seeds, each 8 cm brown, woody. ", 
         "Leaves": "large fan shaped to 4 m long by 3 m across, deeply divided into leaflets, thorny at the base.", 
         "Seeds": "No. of seeds per kg: 2-3. Seeds should be dried in the shade to avoid excessive sunshine on one side of the seed. The seed can be sown without removing the pulp surrounding it. Germination takes one month,"
      }, 
      "Propagation": "Direct sowing on site, seedlings", 
      "Remarks": "Elephants eat the fruits, thus distributing the tree. The wood is hard and resistant to termites and fungi. However, over-tapping of the tree for its sap (palm wine) has made the tree rare. In Uganda, borassus palms are cut and hollowed out to make beehives. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Poles", 
         "Timber (roofing", 
         "Door frames", 
         "Etc"
      ]
   }, 
   "african oil palm": {
      "Description": "A thick palm, usually to 15 m, the wide bole 30-50 cm in diameter covered with the remains of leaf bases.", 
      "Ecology": "A palm found throughout the wetter parts of Africa; origin centred in West Africa. It was introduced to Java in 1848 and is now economically important in Malaysia as well as in West Africa. In East Africa the palm is confined to some habitats in Tanzania, irregularly along the coast and in Uganda in the swamp forests of Bundibugyo District (900 m) and in high-rainfall gallery- forest in Mongiro Forest of the eastern Semliki valley (760 m).", 
      "Names": {
         "English_Name": "African oil palm",
         "Primary_Name": "African Oil Palm", 
         "Scientific_Name": "Elaeis guineensis", 
         "Ugandan_Name": "Mubira"
      }, 
      "Parts": {
         "Bark": "A massive untidy crown of shiny, drooping leaves, loose brown fibres at the base.", 
         "Flower": "arise beside leaves, often before a trunk develops. The massive golden flowering heads, 15-20 cm, male or female. Male flower tiny, aromatic and yellow; female almost round, larger, central joined styles-stigma 1 cm across.", 
         "Fruit": "just above the short trunk, big bunches, each fruit shiny, bright orange, 3-5 cm, upper parts dark red to black, tipped by old style. Below the outer skin is a yellow oil-rich layer 5-10 mm thick. One dark seed lies in the centre, also rich in oil.", 
         "Leaves": "large and pinnate, 3-4 m, 40-50 in a mature crown. The leaf stalk bears 100-150 folded leaflets each side growing out irregularly in two planes, the whole leaf feathery, about 120 cm long and 8 cm across. Leaf stalks wider at the base with sharp fibre-spines along the edge.", 
         "Seeds": "Collect fruit from the big bunches as soon as they are ripe. Remove the outer coat to set free the stony seed"
      }, 
      "Propagation": "Seedlings (sow seed in pots), wildlings and direct sowing at site", 
      "Remarks": "Orange palm oil from the outer flesh is moderately unsaturated; more valuable saturated oil comes from the seed kernel. These are a major world source of vegetable oils and are processed for cooking, soap and margarine manufacture and are a major ingredient in many food products. Palm wine is made from the sugary sap tapped near the growing stem tip, from the flower head or the base of the stem. In plantations, the tree bears fruit in 3-4 years and continues for about 25 years. The wood is not durable in the ground. ", 
      "Uses": [
         "Food", 
         "Oil", 
         "Wine", 
         "Medicine", 
         "Ornamental"
      ]
   }, 
   "alexandra palm": {
      "Description": "A hardy, fast-growing native palm used as a potted ornamental plant or in the garden. Its lush green foliage features fronds with a silver under surface that catches the light, especially when the sun is low.", 
      "Ecology": "Native to  and , , and naturalised in  and parts of . In Uganda, it can grow in littoral rainforest, often in locations that are severely inundated during heavy rain events, such as the Bwindi Impenetrable forests.", 
      "Names": {
         "English_Name": "Alexandra palm",
         "Primary_Name": "Alexandra Palm", 
         "Scientific_Name": "Archontophoenix alexandrae", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "grows with a single trunk to a dramatic height of 20 - 30 feet (6 - 10 meters).", 
         "Flower": "Large creamy-white flowers appear as clusters growing directly off the trunk below the level of the palm fronds. These flower-clusters can themselves grow to approximately 3 feet (1 meter) diameter.", 
         "Fruit": "The flower-clusters bear red berries. ", 
         "Leaves": null, 
         "Seeds": null
      }, 
      "Propagation": "Seedlings", 
      "Remarks": "The Alexandra palm is self-cleaning.", 
      "Uses": [
         "Firewood", 
         "Timber", 
         "Ornament"
      ]
   }, 
   "black plum": {
      "Description": "A small or large tree, 8-14 m, with a heavy rounded crown and a clear bole.", 
      "Ecology": "A deciduous forest tree, widespread in East Africa, often in coastal woodlands but also in savannah and riverine woodlands, generally at lower altitudes. In Uganda, it is found in wooded grassland and woodland, sometimes being the largest tree in the community and associated with Combretum spp. and Grewia mollis.", 
      "Names": {
         "English_Name": "Black plum",
         "Primary_Name": "Black Plum", 
         "Scientific_Name": "Vitex doniana", 
         "Ugandan_Name": "Munya- mazi"
      }, 
      "Parts": {
         "Bark": "pale brown or grey white, with long fissures and scales.", 
         "Flower": "fragrant, in dense bunches on a long stalk, to 12 cm across, each flower cream with one hairy violet lobe; the calyx enlarging to a hairy cup around the fruit.", 
         "Fruit": "oblong to 3 cm, green marked with white dots, black when ripe, edible starchy pulp around the hard nut with 1-4 seeds, dispersed by monkeys.", 
         "Leaves": "opposite and compound, digitate (like fingers), leathery and shiny, each leaflet stalked to 22 cm long, tip rounded or notched, lower leaflets smaller.", 
         "Seeds": "No. of nuts per kg: 1,000-1,100. "
      }, 
      "Propagation": "Seedlings, direct sowing, wildlings", 
      "Remarks": "The species regenerates naturally from seed and root suckers. Forest fires may help break the seed coat before germination. The tree produces a teak-like, termite-resistant timber and edible fruits which can be sold. Monkeys may disperse the seed.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Poles", 
         "Timber", 
         "Food", 
         "Medicine", 
         "Fodder", 
         "Bee forage", 
         "Shade", 
         "Dye"
      ]
   }, 
   "bombax": {
      "Description": "A deciduous forest tree 45-75 m, the straight bole reaching up to a narrow crown has short buttresses at the base. The trunk is armed with large conical woody spines, black-tipped on the younger branches which are generally whorled.", 
      "Ecology": "A tree of tropical rain forest extending into West Africa. It occurs in the Semliki, Maramagambo, Bugoma and Budongo Forests of Uganda, in the swamp forests around Lake Victoria and only rarely on drier sites. ", 
      "Names": {
         "English_Name": "Red silk cotton",
         "Primary_Name": "Bombax", 
         "Scientific_Name": "Bombax buonopozense", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "smooth, silvery or grey-green becoming rough and scaly, dark and fissured. When cut the bark is deep red, with large lenticels (breathing pores) in vertical lines.", 
         "Flower": "solitary and bright red, appearing on the bare tree, held erect all along the branches, the green calyx saucer-shaped, 5 red petals hairy inside and a central mass of black stamens.", 
         "Fruit": "a 5-part woody capsule to 15 cm long hangs down on a thick stalk. Inside numerous seeds are surrounded by grey-white fluffy kapok.", 
         "Leaves": "compound digitate with 5-7 leaflets, narrow-oval and pointed, variable, about 14 cm (up to 20 cm) on a leaf stalk 5-20 cm.", 
         "Seeds": "Seeds embedded in cotton-like fibres can be collected from the ground."
      }, 
      "Propagation": "Seedlings (sow seed in pots) and direct sowing on site", 
      "Remarks": "A tree not yet in general use but which could be promoted more for its potential both as a showy avenue tree and for its useful kapok. The fibres are similar but inferior to the kapok of commerce (Ceiba pentandra). ", 
      "Uses": [
         "Ornamental", 
         "Fibres"
      ]
   }, 
   "bottlebrush": {
      "Description": "A small evergreen tree, to 6 m high, with drooping foliage.", 
      "Ecology": "In Australia it is found on low-lying ground including valley bottoms, so will grow on badly drained sites. Now widely planted in the tropics. Common in Central and Western Regions of Uganda. ", 
      "Names": {
         "English_Name": "Bottlebrush",
         "Primary_Name": "Bottlebrush", 
         "Scientific_Name": "Callistemon citrinus", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "grey, smooth, furrowed with age.", 
         "Flower": "vivid crimson bottle- brush-like cylindrical spikes, a mass of long red stamens, nectar attracting sunbirds and bees. Leafy shoots continue to grow beyond the flower \"brush\".", 
         "Fruit": "small woody capsules, persisting many months, contain the tiny seed. ", 
         "Leaves": "narrow, tough, grey-green to 8 cm, young leaves pink-green, faintly lemon scented when crushed.", 
         "Seeds": "No. of seeds per kg: about 44,000. Seed germination is uniform (two weeks)."
      }, 
      "Propagation": "Seedlings\nSeed: No", 
      "Remarks": "Commonly planted as single ornamental trees in gardens. Another Callistemon variety has erect flowers, not drooping; otherwise they are similar. The bark is commonly used as cough medicine wherever it is planted in Uganda, its removal often damaging the tree. ", 
      "Uses": [
         "Firewood", 
         "Medicine", 
         "Bee forage", 
         "Windbreak", 
         "Ornamental"
      ]
   }, 
   "breadfruit": {
      "Description": "An evergreen tree 15-30 m, up to 50 m, with a dense spreading crown and a fluted trunk.", 
      "Ecology": "A fruit tree of riverine forest in tropical Africa, Madagascar and Tanzania, 0-1,200 m. A rare species in Uganda, it is usually found near streams or in swampy areas in forests up to 1,500 m. ", 
      "Names": {
         "English_Name": "African breadfruit",
         "Primary_Name": "Breadfruit", 
         "Scientific_Name": "Treculia africana", 
         "Ugandan_Name": "Muzinda"
      }, 
      "Parts": {
         "Bark": "grey, smooth, thick, exuding white latex when cut, which later turns rusty-red.", 
         "Flower": "flower head brown-yellow, rounded, 2.5-10.0 cm across, male and female usually separate, growing beside leaves (axillary) or on older wood down to the trunk.", 
         "Fruit": "compound, rounded, very large, up to 30 cm across, on the trunk or main branches, containing many orange seeds, about 1 cm, buried in spongy pulp of the fruit. The outer surface is covered with rough pointed outgrowths. ", 
         "Leaves": "simple, alternate, very large, about 30 x 14 cm (up to 50 x 20 cm), dark green, smooth above, tough, paler below with some hairs on the 10-18 pairs of clear veins, tip pointed, a short stalk to 1.5 cm. Young leaves red or yellow.", 
         "Seeds": "No. of seeds per kg: 4,500-5,000."
      }, 
      "Propagation": "Seedlings (sow seed in pots), direct spot sowing at site", 
      "Remarks": "A tree with potential to be grown in valleys and riverine areas. It could be domesticated on farmlands or planted as an avenue tree. The seeds can be dried, fried and eaten. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Food", 
         "Ornamental"
      ]
   }, 
   "cabbage palm": {
      "Description": "a deciduous palm tree that grows up to 65 feet or 20 metres.", 
      "Ecology": "one of 15 species of  . It is native to the , as well as , the , and .", 
      "Names": {
         "English_Name": "Cabbage palm",
         "Primary_Name": "Cabbage Palm", 
         "Scientific_Name": "Sabal palmetto", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "Starting at ½ to ⅔ the height, the trunk develops into a rounded, costapalmate fan of numerous .", 
         "Flower": null, 
         "Fruit": "a black  about 0.5 inches or 1.3 centimetres long containing a single seed. It is extremely   ", 
         "Leaves": "leaflets are arranged radially like in a palmate leaf. All costapalmate leaves are about 0.20 inches or 5.1 millimetres across.", 
         "Seeds": "One contained inside each fruit. Often planted in nurseries."
      }, 
      "Propagation": "seedling", 
      "Remarks": "The cabbage-like terminal bud has been eaten as .", 
      "Uses": [
         "Firewood", 
         "Scrubbing brushes", 
         "Food", 
         "Ornament\n\ndescription: a deciduous palm tree that grows up to 65 feet or 20 metres"
      ]
   }, 
   "caja fruit": {
      "Description": "a small deciduous tree up to 20 m (66 ft) high and 1.5 m (4.9 ft) in girth, moderately buttressed.", 
      "Ecology": "Native to the tropical , including the . The tree has been  in parts of Uganda, but is rarely grown", 
      "Names": {
         "English_Name": "Caja fruit", 
         "Primary_Name": "Caja fruit", 
         "Scientific_Name": "Spondias mombin", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "thick, corky, and deeply fissured. When slashed, it is pale pink, darkening rapidly.", 
         "Flower": "bloom January to May and are sweet-scented, in large, lax terminal panicles of small white flowers.", 
         "Fruit": "appears July to September and is nearly 4 cm (1.5 in) long, ovoid yellow, acid, wrinkled when dry. The fruits have a sharp, somewhat acid taste and are edible. Their flesh surrounds a single spiny kernel.", 
         "Leaves": "pinnate, with 5-8 leaflets opposite pairs with a terminal leaflet, 10 cm × 5 cm (4 in × 2 in), oblong or oblong lanceolate, broadly acuminate, glabrous.", 
         "Seeds": "The seed is contained inside the fruit and has an oil content of 31.5%"
      }, 
      "Propagation": "Seedlings, widlings", 
      "Remarks": "This tree is also known as hog plum. In  this fruit is called makok and is used in  as a secondary ingredient. In traditional medicine, the fruit has been used as a  and ", 
      "Uses": [
         "Firewood", 
         "Food", 
         "Fruit", 
         "Oil", 
         "Traditional medicine\n\ndescription: a small deciduous tree up to 20 m  high and 1"
      ]
   }, 
   "calabash nutmeg": {
      "Description": "A deciduous forest tree 5-30 m tall, but usually 10-15 m, with a rounded crown giving heavy shade.", 
      "Ecology": "Monodora is a tropical genus of the primitive custard apple family with about 15 species. This tree is typical of rain forest and occurs in all the lowland forest of Uganda in Central, Southern, Western and Eastern Regions.", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Calabash Nutmeg", 
         "Scientific_Name": "Monodora myristica", 
         "Ugandan_Name": "Nagomola"
      }, 
      "Parts": {
         "Bark": "grey with vertical ridges distinctly rounded.", 
         "Flower": "large and single, hanging on stalks to 20 cm-a leafy bract grows from the stalk. Outer 3 sepals narrow to 4 cm, pale green with dark red frilly edges, 3 large outer petals enclose 3 smaller inner ones. Outer petals oval, 4—10 cm cream-yellow with dark red-brown spots and a frilly edge, tip pointed; inner petals broadly oval, cream-white, with purple-brown markings fold over the flower centre like a lantern- There are very many stalkless stamens around the conical ovary.", 
         "Fruit": "globose, 13 cm across, smooth and green becoming brown and woody, containing seeds in a fragrant pulp. Seeds 2.5 cm, shiny and edible. ", 
         "Leaves": "oblong, often wider at the tip, 5-60 cm long and 3-20 cm across (average 20 x 7), the tip shortly pointed, bent back and the base very rounded on a thick 1 cm leaf stalk, purplish like the prominent midrib. Very many side veins are raised below.", 
         "Seeds": "The fruit must be ripe and dry before the seeds can be extracted. The dry fruit may disintegrate and scatter the seeds when they fall on the ground, or they have to be cracked open"
      }, 
      "Propagation": "Seedlings (sow seed in pots), wildlings", 
      "Remarks": "This is a very attractive tree when in flower and when planted as an ornamental it should be allowed plenty of space. The roasted seeds are a potential food and firewood can be obtained by pollarding.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Food", 
         "Ornamental"
      ]
   }, 
   "candle bush": {
      "Description": "An attractive bushy shrub 1-5 m, young stems quite hairy.", 
      "Ecology": "A small bush of forest edges, lowland scrub, woodlands, evergreen thickets, often riparian or in disturbed places in Uganda. It is also cultivated for medicinal purposes.", 
      "Names": {
         "English_Name": "Candle bush", 
         "Primary_Name": "Candle Bush", 
         "Scientific_Name": "Senna didymobotrya", 
         "Ugandan_Name": "Mukyula"
      }, 
      "Parts": {
         "Bark": null, 
         "Flower": "on erect stalks to 30 cm, in dense clusters, conspicuous as thin shiny brown sepals overlap and cover the rounded buds. Below each bud is a leafy bract. Open flowers at the base of the head have bright yellow petals over 2 cm long, the stamens of 3 sizes with straight stalks.", 
         "Fruit": "oblong, dark-brown pods, to 12 cm by 2 cm across, flattened with sections across holding the flat seeds. Pods break open when dry.", 
         "Leaves": "compound on spreading stalks to 30 cm, without glands, characteristic leafy stipules at the base over 2 cm long, heart- shaped and pointed, 8-18 pairs of oval hairy leaflets to 6 cm long, each with a rounded apex bearing a clear, stiff, hair-like tip. Crushed leaflets have peculiar bitter smell.", 
         "Seeds": "Contained in flat pods; collect and crush."
      }, 
      "Propagation": "Wildlings, seedlings, direct sowing on site", 
      "Remarks": "The leaves, pods and roots are poisonous, so care should be taken with dosage. The bark contains tannin. The leaves can be used as fish poison. Good to grow as a stand around the home. ", 
      "Uses": [
         "Firewood", 
         "Medicine", 
         "Mulch", 
         "Soil conservation"
      ]
   }, 
   "candle-nut": {
      "Description": "An evergreen tree 10-20 m with a leafy rounded crown.", 
      "Ecology": "A tree growing on hillside forests of S.E. Asia and the Pacific islands where its pale foliage stands out from the darker green vegetation. (\"Aleuron\" is a Greek word meaning floury.) Well known and used in those areas and imported into Hawaii where it is the national tree emblem, it is now planted throughout the tropics. It grows well in the wetter parts of Uganda and is a garden favourite in Central Region. ", 
      "Names": {
         "English_Name": "Candle-nut tree", 
         "Primary_Name": "Candle-nut", 
         "Scientific_Name": "Aleurites moluccana", 
         "Ugandan_Name": "Kabakanjagala"
      }, 
      "Parts": {
         "Bark": "grey-brown, fairly smooth with fine vertical lines.", 
         "Flower": "in large loose heads, male and female, each cream-white, less than 1 cm, with 5 oblong petals. Flowering may be several times each year.", 
         "Fruit": "clusters of nuts, green and round, fleshy to 6 cm long, with 1-2 hard-shelled black seeds containing oil. ", 
         "Leaves": "in clusters at the ends of branches, hand sized, 10-30 cm long, oval or 3-5 lobed, tips pointed, on long stalks. Young leaves pink- green, young shoots and leaves covered with grey-white hairs, white floury above, more rust coloured below. Mature leaves shiny above.", 
         "Seeds": "Seeds profuse and easily collected,"
      }, 
      "Propagation": "Seedlings (sow seeds in pots), wildlings, direct sowing at site", 
      "Remarks": "Plant as a back-yard tree for firewood. Investigation is required on the extraction and use of oil from the seeds. After removing the hard outer coat, the seed is pounded and eaten as a sauce. The oil is semi-drying and can be used for soap, paint and varnish but is much inferior to tung oil.", 
      "Uses": [
         "Firewood", 
         "Food", 
         "Shade", 
         "Ornamental", 
         "Oil"
      ]
   }, 
   "cassia": {
      "Description": "A small rounded deciduous tree generally less than 10 m tall. The bole is short and tends to fork near the ground. Bare for several months.", 
      "Ecology": "This tree is native to central and northern South America. It has been introduced in Africa as an ornamental. Cassia spectabilis is tolerant of cool conditions (15-25°C) and therefore suitable for elevations up to 2,000 m. Will grow well with a mean annual rainfall of 800-1,000 mm in deep, moist, sandy or loamy soils. In Uganda it is widely cultivated as a boundary marker and in woodlots, especially in Central and Western Regions. ", 
      "Names": {
         "English_Name": "Cassia", 
         "Primary_Name": "Cassia", 
         "Scientific_Name": "Senna spectabilis", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "smooth, grey with horizontal markings.", 
         "Flower": "golden yellow in erect pyramid clusters to 60 cm high, all over the tree.", 
         "Fruit": "long cylindrical or flattened pods, turning from green to black, the seeds in separate compartments.", 
         "Leaves": "compound to 40 cm, with many pointed leaflets, often softly hairy below.", 
         "Seeds": "No. of seeds per kg: about 39,000. Seeds profusely."
      }, 
      "Propagation": "Direct sowing at site, seedlings", 
      "Remarks": "The wood is termite resistant. Easy to raise and less susceptible to pests and diseases than Senna siamea. The coppicing ability is very good. Trees more than 50 years old are still coppicing. Every rural home in areas where the species performs well ought to have at least ten trees growing on their land to meet the domestic demand for fuel.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Tool handles", 
         "Bee forage", 
         "Shade", 
         "Ornamental", 
         "Mulch"
      ]
   }, 
   "croton": {
      "Description": "A spreading deciduous tree to 35 m with distinctive layering of branches, the crown rather flat and giving light shade.", 
      "Ecology": "A dominant upper-storey tree in some evergreen or semi-deciduous forested areas of East Africa. Widespread in most forests, particularly in Kabale and the Impenetrable (Bwindi) Forests and in some Toro forests, but uncommon in Bunyoro. It can be found in a range of semi-humid habitats, 1,200-2,400 m, but has been planted at lower altitudes. ", 
      "Names": {
         "English_Name": "Croton", 
         "Primary_Name": "Croton", 
         "Scientific_Name": "Croton megalocarpus", 
         "Ugandan_Name": "Nkulumire"
      }, 
      "Parts": {
         "Bark": "dark grey, rough, cracking.", 
         "Flower": "very short-lived but conspicuous, the buds opening after heavy rains into pale yellow, hanging spikes to 25 cm, with only a few female flowers at the base.", 
         "Fruit": "very many grey woody capsules, about 2.5 cm long with three flattened seeds inside, grey-brown when mature with a small bump (the caruncle). ", 
         "Leaves": "variable, long oval and pointed to 12 cm but often much smaller, stalked. The dull green upper surface contrasts with the pale, silvery underside.", 
         "Seeds": "No. of seeds per kg: about 1,000. The tree seeds prolifically. Extract seed by cracking fruit shell and sun-dry firm mature seed. Germination is good: up to 70% after 30 days,"
      }, 
      "Propagation": "Direct sowing on site (recommended), seedlings (sow seed in pots), wildlings", 
      "Remarks": "The seed has a high oil content (30%) and a high protein content (50%). The oil extract can be a strong purgative. The heavy timber is not durable and the heartwood has a very bad smell. The sap also has a spicy odour. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Medicine", 
         "Bee forage", 
         "Shade", 
         "Ornamental", 
         "Mulch", 
         "Live fence", 
         "Boundary marker"
      ]
   }, 
   "drum tree": {
      "Description": "A large tree 30-35 m, the trunk wavy, rarely straight, the bole about 10 m before branching to a thinly spreading crown. Buttresses usually absent, or short and blunt.", 
      "Ecology": "A forest tree of the upper canopy in lowland and intermediate forest, but also in thickets in grasslands and in riverine forests. The tree is often left for shade in Eucalyptus and coffee planta- tions. In Uganda it is abundant in Budongo and Kabale Forests, occurs in Mengo, Masaka, Toro, Bunyoro and the Zoka Forest, but is less common elsewhere.", 
      "Names": {
         "English_Name": "Drum tree", 
         "Primary_Name": "Drum tree", 
         "Scientific_Name": "Cordia millenii", 
         "Ugandan_Name": "Mukebu"
      }, 
      "Parts": {
         "Bark": "pale brown, thick and rough with deep vertical fissures. A cut is yellow at first and then greenish, finally dark brown.", 
         "Flower": "pale yellow and fragrant in heads about 25 cm long, hanging down, each flower, bell shaped, 5 jointed petals, longer than the calyx, but less than 2 cm.", 
         "Fruit": "ovoid, 3-4 cm, green then brown, pointed, cupped in the enlarged woody calyx.", 
         "Leaves": "very rounded, alternate but at ends of branchlets, about 16 cm x 13 cm across with 3-7 main veins arising near the base, tip rounded, base almost heart shaped, edge wavy, entire or slightly toothed, smooth above but hairy brown below, on stalks to 12 cm.", 
         "Seeds": "Collect fallen fruit when mature and dry slowly,"
      }, 
      "Propagation": "Seedlings, wildlings or sow directly on site", 
      "Remarks": "The tree has been used in reafforestation and as a shade tree. It is a favourite for dugout canoes both because it is easily adzed and the canoe floats if overturned. The Luganda and Runyoro names can apply to any tree used to make musical instruments. The yellow-brown timber is also very suitable for furniture. Hornbills eat the fruit and so disperse the seed. ", 
      "Uses": [
         "Timber", 
         "Carving", 
         "Boat building", 
         "Bee forage", 
         "Shade"
      ]
   }, 
   "east african green wood": {
      "Description": "An evergreen tree to 25 m with a dense leafy canopy.", 
      "Ecology": "A widely distributed tree in lower rain forest and drier highland forest areas of East Africa, 1-2,000 m. In Uganda, it grows in colonizing forest, forest edges and thickets, often on dry sites. It is widely distributed and abundant in Maramagambo Forest. ", 
      "Names": {
         "English_Name": "East African green wood", 
         "Primary_Name": "East African Green Wood", 
         "Scientific_Name": "Warburgia ugandensis", 
         "Ugandan_Name": "Mukuzanume"
      }, 
      "Parts": {
         "Bark": "rough brown-black, cracked into rectangular scales.", 
         "Flower": "inconspicuous green-cream.", 
         "Fruit": "round to egg-shaped, to 5 cm long on short stalks, green to purple with a waxy, white surface. Several flat heart-shaped seeds inside a pulp. ", 
         "Leaves": "shiny dark green above, midrib very clear below, edge wavy, to 10 cm long.", 
         "Seeds": "No. of seeds per kg: about 10,000. Germination over 80% in approximately 15 days. Collect fruit directly from the tree or shake off. Seeds are sensitive to drying out and should be sown fresh without drying."
      }, 
      "Propagation": "Cuttings, seedlings, direct sowing, wildlings", 
      "Remarks": "After seasoning, the heartwood develops a slight greenish colour which fades with exposure to light. The wood, though hard and heavy, is not durable in the ground and not termite resistant. It has a high oil content. The leaves, bark, young shoots and fruit can be used in curries, and roots are used for soup. Can be intercropped for shade in coffee, banana and cocoa plantations.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Furniture", 
         "Tools", 
         "Food", 
         "Medicine", 
         "Mulch", 
         "Shade", 
         "Ornamental", 
         "Resin"
      ]
   }, 
   "english yellow mulberry": {
      "Description": "A medium-sized tree to 10 m with a short bole and large branches, often carried on stilt roots to 60 cm.", 
      "Ecology": "A rain-forest tree of East Africa south to Mozambique. In Uganda, it grows in lowland and mountain forests preferring moist valleys and river banks. Two forms occur: the lowland form has larger leaves and fruits and the mountain form smaller ones.", 
      "Names": {
         "English_Name": "Giant yellow mulberry", 
         "Primary_Name": "English Yellow Mulberry", 
         "Scientific_Name": "Myrianthus holstii", 
         "Ugandan_Name": "Mugunga"
      }, 
      "Parts": {
         "Bark": "grey-brown, much watery sap.", 
         "Flower": "sexes on separate trees, male greenish flowers on stalked heads, female in small round yellow heads on a short stalk.", 
         "Fruit": "round, 4 cm across, hard and yellow when ripe, sections like a pineapple. Seeds surrounded with acid edible pulp.", 
         "Leaves": "distinctive large palmate with 5-7 leaflets, largest central 20-30 cm, outer leaflets smaller, edge saw-toothed, upper leaf smooth dark green, lower side grey-green hairy with conspicuous veins, leaves are stalked.", 
         "Seeds": "Contained in a compound fruit similar to a pineapple."
      }, 
      "Propagation": "Seedlings, wildlings", 
      "Remarks": "Large leaves rot below the tree making mulch, thus the tree is good for soil conservation. Recommended for planting in valley bottoms to control silting of rivers.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Fruit", 
         "Mulch", 
         "Soil and water conservation"
      ]
   }, 
   "false muvule (kirudu)": {
      "Description": "A magnificent deciduous tree of the forest canopy, often 20 m, up to 40 m, the crown rounded, branchlets drooping. A large tree may have a tall clear bole with some buttresses at the base.", 
      "Ecology": "A forest tree with 3 varieties not clearly distinguished, especially when young. While one is found largely in wooded grassland, the others grow in rain forest, wetter forest, riverine and semi-swamp forests west to Sierra Leone, into southern Sudan and south to Zaire and Angola. It grows in all regions of Uganda except the North Eastern, 1,350-1,700 m.", 
      "Names": {
         "English_Name": null, 
         "Primary_Name": "False Muvule (Kirudu)", 
         "Scientific_Name": "Antiaris toxicaria", 
         "Ugandan_Name": "Kirundu"
      }, 
      "Parts": {
         "Bark": "smooth, pale grey, marked with lenticel dots and ring marks. When cut thin cream latex drips out, becoming darker.", 
         "Flower": "small male flowers, yellow-green, in clusters about 1.5 cm across, growing just below leaves. Female flowers in disc- or kidney- shaped heads to 3 cm across.", 
         "Fruit": "bright red, dull and furry, 1.5 cm long, the swollen receptacle contains just one seed. The soft fruit is liked by birds, bats, monkeys and antelope and therefore dispersed by them.", 
         "Leaves": "variable, usually oval 5-16 cm x 4-11 cm, the upper half often widest to a blunt or pointed tip, the base unequal and rounded. Saplings and coppice shoots have long narrow leaves, the edge toothed—but rare in mature leaves. Leaves are rough, papery with stiff hairs above but softer below.", 
         "Seeds": "Large amounts of seed; easy to collect from the ground,"
      }, 
      "Propagation": "Wildlings and seedlings (sow seeds in pots)", 
      "Remarks": "The root or leaves are used to treat mental illnesses. In Kitgum District the bark is used for making bark cloth but it is not as good quality as that made from Ficus. The trunk is used to make \"beer canoes\" in Central Region. The tree does not compete with crops. Plant individual trees for shade, as avenue trees or as a pure stand. There is little difference between heart and sapwood; it is yellow-white and soft, easily attacked by termites and borers. It can make a tough veneer for the plywood industry. ", 
      "Uses": [
         "Timber", 
         "Medicine", 
         "Bark cloth"
      ]
   }, 
   "granite mangosteen": {
      "Description": "A small evergreen understorey tree, 6-13 m, often densely branched to a thick dark shady crown. All parts contain a rather sticky yellow sap.", 
      "Ecology": "One of several Garcinia species growing from East to Southern Africa. They contain a distinctive yellow latex. In Uganda, this tree is found in high-rainfall savannah woodland, thickets, gallery forests and forest edges. The species is not common but widely distributed in Uganda, ranging from very moist sites on the shores of Lake Victoria, particularly on the western shore, to very dry- sites in North Eastern Region. ", 
      "Names": {
         "English_Name": "Granite Mangosteen", 
         "Primary_Name": "Granite Mangosteen", 
         "Scientific_Name": "Garcinia buchananii", 
         "Ugandan_Name": "Musaali"
      }, 
      "Parts": {
         "Bark": "smooth, dark grey-brown, later rough and flaking, the under bark a bright red-brown.", 
         "Flower": "white, yellow or orange, about 1 cm across, female solitary, male in clusters of 2-3, 4 petals and sepals around a sticky orange centre, x-shaped when open. Flowers in December-January with fruit January-April.", 
         "Fruit": "Fleshy berries, yellow-orange when mature, rounded to 2.5 cm across. Edible but very acid pulp surrounds the seed. ", 
         "Leaves": "opposite, thick and leathery, shiny dark green above, paler below, lateral veins thin and fine on both sides, edge rolled under and wavy, oval-oblong, usually 6-12 cm long, the tip long pointed, the base narrowed to a very short stalk which may be pink. Buds often resin covered.", 
         "Seeds": "Ripe fruits are collected and put in a cool place for the pulp to rot and fall away. Then dry in the sun after which the seeds are separated."
      }, 
      "Propagation": "Seedlings (sow seed in pots), wildlings", 
      "Remarks": "A wine is being made from the edible fruit at Kisizi in Kabale District. The hard yellow timber is suitable for buildings, and the firewood is of high quality. The species can be raised as a pure fruit orchard or intercropped with coffee. Individual trees are also good ornamentals. The fruit has a high vitamin-C content. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Fruit", 
         "Drink", 
         "Ornamental"
      ]
   }, 
   "guava": {
      "Description": "A small evergreen tree to 8 m, branching irregularly.", 
      "Ecology": "This tree originates from South America, probably Brazil, but is now grown throughout the tropics, including Africa south of the Sahara. In Uganda, it is grown in all Regions of the country including North Eastern Region where it occurs near water around Mt. Kadam. It is a moisture-loving species, requiring rainfall of 1,000-2,000 mm. It is drought resistant but cannot tolerate waterlogging. It grows at a wide range of altitudes in Uganda. ", 
      "Names": {
         "English_Name": "Guava", 
         "Primary_Name": "Guava", 
         "Scientific_Name": "Psidium guajava", 
         "Ugandan_Name": "Mupeera"
      }, 
      "Parts": {
         "Bark": "smooth, pale brown, later peeling and flaking; young shoots 4- sided.", 
         "Flower": "white, about 2.5 cm across, 1-3 together beside leaves, many stamens.", 
         "Fruit": "rounded to 6 cm long, tipped by remains of calyx, pink, white, or yellow, depending on the variety. The sweet flesh surrounds many hard angular seeds. ", 
         "Leaves": "large, dull and oval to 15 cm long, side veins prominently hairy below, in opposite pairs.", 
         "Seeds": "No. of seed per kg: about 500,000."
      }, 
      "Propagation": "Seedlings, root suckers, direct sowing on site, wildlings", 
      "Remarks": "The fruit is often attacked by fruit fly. It is rich in vitamin C. The leaves do not decompose easily to add organic matter to the soil. The fruit is a useful source of cash for farmers. Trees bear fruit in 3-4 years and continue to fruit for up to 30 years. The wood is termite resistant.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Poles", 
         "Tool handles", 
         "Food", 
         "Fruit"
      ]
   }, 
   "iroko": {
      "Description": "Old trees may have a straight trunk clear to 21 m and 2 m in diameter. The high umbrella crown grows from a few thick branches. Ultimate branches hang down (only female trees; male individuals have upright branches).", 
      "Ecology": "A giant deciduous tree of lowland forest and wet savannah that is logged commercially throughout its range. Widespread throughout tropical Africa, Ivory Coast to Angola, Sudan to Mozambique. It can grow well with mean annual rainfall as low as 700 mm provided it has access to extra water from a perennial stream or underground. It does not tolerate waterlogging and the soils must be well drained and relatively fertile. In Uganda, it is abundant in Jinja, Kamuli and Iganga Districts, though it occurs in most Districts of the country.", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Iroko", 
         "Scientific_Name": "Milicia excelsa", 
         "Ugandan_Name": "Muvule"
      }, 
      "Parts": {
         "Bark": "thick, pale, grey then brown, exudes slightly milky sap, as do the leaves.", 
         "Flower": "trees are male or female, both with small flowers in spikes, male flowers in drooping catkins to 15 cm, female shorter and thicker.", 
         "Fruit": "like a long, green mulberry, 6-7 cm, the soft pulp attracting birds and bats. Fruits ferment rapidly on the ground. Small hard seeds lie in the pulp.", 
         "Leaves": "large, oval to 18 cm, rather thin, a well-pointed tip, 10-18 pairs clear side veins, base rounded, often unequal sided, stalk to 4 cm, leaf edge finely toothed and wavy.", 
         "Seeds": "No. of seeds per kg: about 475,000. The tree produces plenty of seeds in Uganda, and seed collection is not difficult. Collect the whole fruit, crush and float in water. Seeds sink and can easily be separated."
      }, 
      "Propagation": "Seedlings, stumps, wildlings", 
      "Remarks": "The wood is hard, durable and termite resistant and resembles teak. Therefore, it is extremely valuable timber, used especially for quality indoor and outdoor furniture. In Kenya, the species is now rare and endangered. Trees planted 50 years ago in Uganda are now ready to harvest. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Shade", 
         "Ornamental", 
         "Mulch", 
         "Soil conservation"
      ]
   }, 
   "jackfruit": {
      "Description": "A medium-sized tree with thick branches, to 25 m. The bole is short, cylindrical and straight, up to 1 m in diameter in old specimens, branching less than 2 m from the ground.", 
      "Ecology": "Originates from Asia, probably in the forests of the Western Ghats in India. Today it is widespread in other parts of the tropics and most popular in Sri Lanka. Introduced into Uganda in the early 1940s at Entebbe Botanic Garden, it has become very popular and is now commonly planted in Eastern, Central and Western Regions. Near Lake Victoria seeds germinate and young trees sprout spontaneously so that the species has become invasive in secondary vegetation. It requires well-drained, deep and fertile soils and will not tolerate drought or waterlogging. ", 
      "Names": {
         "English_Name": "Jackfruit", 
         "Primary_Name": "Jackfruit", 
         "Scientific_Name": "Artocarpus heterophyllus", 
         "Ugandan_Name": "Yakobo"
      }, 
      "Parts": {
         "Bark": "rough bark on the bole, grey but smooth on the branches.", 
         "Flower": "separate male and female, all very small but the female flowers have a stronger smell. The flowers are borne on the trunk or large branches where the fruit—the largest known—develops.", 
         "Fruit": "massive and irregular \"cauliflowery\", yellow-green compound fruit with a spiky rind, reaching a record 20 kg in weight and 1 m in length. The flesh is sweet and edible but definitely an acquired taste. Seeds, up to 5 cm, are edible when roasted.", 
         "Leaves": "glossy, oval to 15 cm long and 10 cm wide.", 
         "Seeds": "Seeds are hand picked individually from the fruit flesh after drying."
      }, 
      "Propagation": "Direct sowing at site, wildings", 
      "Remarks": "Suitable around compounds as a shade tree or support for climbing crops such as yams and passion fruit. Commonly intercropped with coffee and banana in Uganda. The fruit may be eaten in times of drought when other crops have failed. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Food", 
         "Medicine", 
         "Fodder", 
         "Shade", 
         "Gum"
      ]
   }, 
   "jumping seed tree": {
      "Description": "A small to medium-sized deciduous tree occasionally reaching 20 m. The trunk may be crooked, drooping branches arise low down giving a spreading crown.", 
      "Ecology": "A tree of secondary scrub, fringing forest and forest edges extending from Ethiopia to South Africa. It grows throughout Uganda in savanna, thickets and along streams. It is widespread and often abundant in open forest, larger gaps and at forest edges as it is light demanding.", 
      "Names": {
         "English_Name": "Jumping Seed tree", 
         "Primary_Name": "Jumping Seed tree", 
         "Scientific_Name": "Sapium ellipticum", 
         "Ugandan_Name": "Musasa"
      }, 
      "Parts": {
         "Bark": "light brown to almost black, rough, branches tending to droop. White latex only seen when young parts are cut.", 
         "Flower": "no petals or sepals. Flowers catkin-like in spikes 5-10 cm long, the upper part with tiny male flowers each with yellow stamens; 2-5 rounded female flowers at the base, larger, on longer stalks.", 
         "Fruit": "2-part red capsules about 1 cm across, topped with remains of style. The capsule finally opens to set free seeds. Seeds often eaten by insect larvae.", 
         "Leaves": "long, oval, dark above, paler below, turning dark red before falling, to 14 cm long, tip pointed, edge irregularly toothed, midrib and veins raised below, about 10 pairs side veins; base narrow or rounded to a 1-2 cm stalk.", 
         "Seeds": "Collected in capsules which are cracked to extract seed. The seeds are sometimes seen jumping a few centimetres into the air every now and then. This is caused by the seeds containing the larvae of a moth."
      }, 
      "Propagation": "Wildlings, direct sowing at site", 
      "Remarks": "Leaves and roots are used to treat mumps. In Central Region the trunk is cut and shaped into an anvil for barkcloth making. It has become scarce in some areas because of incursion of its habitat.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Farm tools", 
         "Tool handles", 
         "Medicine", 
         "Ornamental"
      ]
   }, 
   "kapok": {
      "Description": "A tall deciduous tree up to 30 m with conspicuous, horizontally layered branches, the trunk covered with sharp conical spines when young, heavily buttressed with age.", 
      "Ecology": "A distinctive tree, widely found in the tropics. An important crop, e.g. in Malaysia and Sri Lanka where unripe fruit and seed oil are used as food. In Uganda it is intercropped with coffee and tea and also planted as an avenue tree. ", 
      "Names": {
         "English_Name": "Kapok tree", 
         "Primary_Name": "Kapok", 
         "Scientific_Name": "Ceiba pentandra", 
         "Ugandan_Name": "Kafamba"
      }, 
      "Parts": {
         "Bark": "young branches green, old bark grey, smooth.", 
         "Flower": "small to 3 cm across, pink-white in clusters, 5 petals, silky hairy outside, pollinated by bats when the flowers open in the evening.", 
         "Fruit": "large woody capsules to 30 cm, conspicuous on the bare tree; contain rounded black seeds with long silky white fibres (\"kapok\"). ", 
         "Leaves": "compound, 5-15 leaflets radiating from a long stalk, to 20 cm, each leaflet long and narrow, 8-16 cm.", 
         "Seeds": "No. of seeds per kg: 10,000-45,000. Germination rate is 50-85%."
      }, 
      "Propagation": "Seedlings (sow seed in pots), cuttings", 
      "Remarks": "Kapok fibre burns easily but is water repellent and lighter than cotton. The wood is so soft it has few uses. The tree is very shallow rooted and easily damaged by high winds. Kapok is little used nowadays since plastic foam is used for most stuffing and mattresses.", 
      "Uses": [
         "Fodder", 
         "Medicine", 
         "Ornamental", 
         "Fibre", 
         "Mattresses"
      ]
   }, 
   "lemon-scented gum": {
      "Description": "The tree may reach 40 m, with evergreen drooping foliage, the crown rounded.", 
      "Ecology": "Grows in a wide range of climates, and performs very well in the Central and Western Regions, 1,300-2,000 m.", 
      "Names": {
         "English_Name": "Lemon-scented gum", 
         "Primary_Name": "Lemon-scented Gum", 
         "Scientific_Name": "Eucalyptus citriodora", 
         "Ugandan_Name": "Kalitunsi"
      }, 
      "Parts": {
         "Bark": "jigsaw patterned, with patches of grey, brown, yellow; older bark smooth grey-white.", 
         "Flower": "smooth oval buds on stalks, white flowers.", 
         "Fruit": "rather large, oblong cup-shaped, about 1 cm, in clusters. ", 
         "Leaves": "very long and narrow, veins parallel to the edge.", 
         "Seeds": "Species is not a prolific seeder like other Eucalyptus spp. Germina- tion rate 60-90 %. No. of seeds per kg: 110,000-1,200,000."
      }, 
      "Propagation": "Seedlings", 
      "Remarks": "The tree is easily identified by the strong scent of lemon oil in the leaves which perfumes the air, especially after rain. Y ung seedlings are susceptible to termite attack. Large branches are brittle and break off in high winds. It produces heavy, durable wood from the straight trunk, but the timber is often attacked by borers. Can be planted in a pure stand or as an ornamental or avenue tree.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Essential oils", 
         "Poles", 
         "Timber", 
         "Bee forage", 
         "Medicine", 
         "Windbreak"
      ]
   }, 
   "loquat": {
      "Description": "A dense evergreen shrub or small tree to 7 m, branching close to the ground.", 
      "Ecology": "A small evergreen tree very widely planted in its native China, Japan and northern India, and also in the Mediterranean. Mainly planted in cities and towns, 1,500-2,400 m. Requires moderate to heavy rainfall but is drought resistant once established. Trees growing in the highlands of Fort Portal, Kabale, Kisoro, Rukungiri and Mbale Districts produce good large fruit, but at lower altitudes around Kampala the fruit are very small. ", 
      "Names": {
         "English_Name": "Loquat",
         "Primary_Name": "Loquat", 
         "Scientific_Name": "Eriobotrya japonica", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "grey and rough, young stems hairy.", 
         "Flower": "cream-white, scented, in pyramidal heads at the end of branches, each flower 2 cm across, flower buds covered with golden-brown hairs.", 
         "Fruit": "in loose clusters, yellow, egg shaped, usually 2-7 cm long, acid-sweet flesh around a few large brown-black seeds.", 
         "Leaves": "stalkless, dark green, shiny above, woolly hairs below, about 35 cm long, the tip pointed and the edge prickly, toothed, young leaves paler, foliage in upward pointing tufts.", 
         "Seeds": "No. of seeds per kg: about 600."
      }, 
      "Propagation": "Direct sowing on site, seedlings (sow seed in pots), wildlings and grafts", 
      "Remarks": "Seeds are poisonous and should be removed before cooking. Grafted trees, when available, remain smaller but make stronger growth and produce fruit faster. Grow as ornamental or in an orchard.", 
      "Uses": [
         "Firewood", 
         "Poles", 
         "Posts", 
         "Carving", 
         "Food", 
         "Bee forage", 
         "Mulch", 
         "Ornamental", 
         "Shade", 
         "Windbreak", 
         "Jam", 
         "Syrup"
      ]
   }, 
   "mango": {
      "Description": "A densely leafy evergreen tree with a trunk soon branching to a rounded crown, usually 10-15 m.", 
      "Ecology": "One of the most important tropical fruit trees brought very early to East Africa. In Uganda, it is widely cultivated in Northern and North Eastern Regions. It does not tolerate flooding and prefers sandy-loamy soil which is well drained, but it can do quite well in dry areas. Roots penetrate deeply, so rocky subsoil should be avoided. The extensive shallow roots collect water and nutrients in upper soil levels. Does well from 700 to 1,800 m. ", 
      "Names": {
         "English_Name": "Mango", 
         "Primary_Name": "Mango", 
         "Scientific_Name": "Mangifera indica", 
         "Ugandan_Name": "Muyembe"
      }, 
      "Parts": {
         "Bark": "dark brown, cracking with age.", 
         "Flower": "numerous and small in pink-brown pyramidal heads. Pollination by flies and other insects.", 
         "Fruit": "fleshy, 8-15 cm, the skin green-red- yellow, the flattened \"stone\" is fibrous and woody around the large seed. ", 
         "Leaves": "dark green, crowded at the ends of branches, to 30 cm long, smelling of turpentine when crushed. Young leaves soft, copper-coloured and hanging limply.", 
         "Seeds": "Germination rate 60-90%. No. of seeds per kg: +50."
      }, 
      "Propagation": "Seedlings (sow seed in pots), direct sowing at site, grafting", 
      "Remarks": "Good varieties have fruits with a good flavour and little fibre. Relatively few flowers are pollinated, but even so up to 1,000 fruit develop on a mature tree. Each one has a large seed surrounded by golden juicy flesh, rich in vitamins A and C. Mango is an effective firebreak. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Food", 
         "Bee forage", 
         "Ornamental", 
         "Shade", 
         "Windbreak", 
         "Soil conservation", 
         "Gum"
      ]
   }, 
   "mpewere": {
      "Description": "A very large deciduous tree to 50 m, branching relatively low down to give feathery layered foliage. Trunk often leaning or wavy to a wide flat crown. There are large thin buttresses extending 3-5 m up the bole. They may extend outwards like curved planks to 30 cm high radiating out to 5 m along the forest floor.", 
      "Ecology": "A tall tree of tropical lowland rain forest and riverine forest from Senegal, Sudan to Angola and Zaire. In Uganda it is a common and very characteristic species of the forests of the Lake Victoria belt, riparian in habit. ", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Mpewere", 
         "Scientific_Name": "Piptadeniastrum africanum", 
         "Ugandan_Name": "Mpewere"
      }, 
      "Parts": {
         "Bark": "yellow-grey-brown, thin and smooth with ring marks and numerous very small lenticel dots. Bark on buttresses may have red-brown upper edges; when cut the slash is dry and pale yellow (resin in Newtonia). Young branchlets densely brown hairy.", 
         "Flower": "yellow-white, fading orange-brown, on branched spikes each one 4-11 cm with a hairy brown stalk. Each tiny flower has a cup-like calyx, 5 petals and 10 longer stamens. Flowering is irregular but dense masses of flowers appear on upper branches.", 
         "Fruit": "flat pods, dark brown, 17-36 cm long, about 2.5 cm wide, split open on one side only to release seed while still on the tree. Seeds lie transversely in the pod (unlike Newtonia), each one flat and 5-9 cm long, brown and oblong, surrounded by a membranous wing. ", 
         "Leaves": "bipinnate with 10-19 pairs of pinnae which are usually alternate (not opposite as in Newtonia), very many tiny narrow leaflets to 8 mm long, slightly curved. No glands on leaf stalk (contrast Newtonia).", 
         "Seeds": "On dehiscing, the winged seeds are blown away from the mother tree. Seed must be collected by searching throughout the forest until the required amount is collected,"
      }, 
      "Propagation": "Wildings, seedlings", 
      "Remarks": "The timber has been used in Kenya for cabinet work, sleepers and wagon building. The species has been successfully tried in plantations by the Uganda Forest Department. It is also suitable as a shade tree in banana, coffee and cocoa plantations. Many fine specimens can be seen in the Entebbe Botanic Gardens. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Shade"
      ]
   }, 
   "mugavu": {
      "Description": "A deciduous tree 6-36 m, the crown spreading and flat, the trunk often twisted, any buttresses short and blunt.", 
      "Ecology": "A timber tree found from West Africa to the Sudan and south to Angola, though absent from the eastern and southern parts of Central Africa. It is found throughout Uganda on a variety of soils; common at forest edges, in wooded grassland, woodland and thicket 850-1,680 m. It is a pioneer species requiring light and will not grow in tropical forest with a closed canopy.", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Mugavu", 
         "Scientific_Name": "Albizia coriaria", 
         "Ugandan_Name": "Mugavu"
      }, 
      "Parts": {
         "Bark": "grey-black, rough and scaling raggedly. Young branchlets rather hairy.", 
         "Flower": "very many sweet-smelling white flowers in half-spherical heads, the stamen filaments red above but not or hardly hanging out beyond the flower tube.", 
         "Fruit": "flat purple-brown pods, often shiny, 14-20 cm long, about 3 cm wide, tip and base narrowed, becoming papery, the few seeds inside about 1 cm, round and flat.", 
         "Leaves": "new growth pale bright green. Bipinnate with 3-6 pairs pinnae and 6-11 pairs of medium-large leaflets, all about equal in size, to 3 cm long, hardly one-sided, narrowly oval-oblong, rounded and often wider at the base, tip rounded.", 
         "Seeds": "About 6,000 seeds per kg. Seed is susceptible to beetle attack, often while still on the tree. Good germination rate. The tree is a prolific seeder."
      }, 
      "Propagation": "Seedlings, wildlings", 
      "Remarks": "In Uganda the tree is used as a prop for food climbers like Dioscorea, passion fruit and Taeferia. The Hima community make beautiful milk jars from the wood. The sapwood is soft but the heavy heartwood is hard and durable. The brown timber makes good furniture. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Furniture", 
         "Boat building", 
         "Medicine", 
         "Fodder", 
         "Bee forage", 
         "Ornamental", 
         "Shade", 
         "Nitrogen fixation", 
         "Toothbrushes", 
         "Banana ripening"
      ]
   }, 
   "mukookowe": {
      "Description": "A shrub or even a climber, sometimes epiphytic on other trees, becoming a tree 12-15 m high, young branchlets stout and purple, ribbed. A spreading open crown.", 
      "Ecology": "A fig tree of deciduous woodland, wooded grassland, riverine or lakeside from Senegal to Ethiopia to Mozambique and northern Angola. Found in both savannah and forest areas of Uganda and widely planted in Central Region and in parts of Hoima and Kibale Districts. ", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Mukookowe", 
         "Scientific_Name": "Ficus ovata", 
         "Ugandan_Name": "Mukookowe"
      }, 
      "Parts": {
         "Bark": "pale, thin and smooth.", 
         "Flower": null, 
         "Fruit": "single or paired figs, often with a brown \"bud cover\" at first: Fresh ripe figs long oval, 3-5 cm, green with white spots, 4 bracts persistent.", 
         "Leaves": "rather large, about 22 x 12 cm (9-31 cm long), the outer basal veins not reaching the middle of the leaf, 6-13 other veins each side, tip long pointed, the base rounded to a long stalk 3-10 cm.", 
         "Seeds": "The seeds are contained in the figs. Slice them in half, dry in the sun and then shake out the seeds. "
      }, 
      "Propagation": "Use of cuttings is the quickest methods of propagation, but seedlings are also used", 
      "Remarks": "The tree produces poles in a period of five years. In Mbarara and Masaka Districts it is planted for poles used in house building. Also good in compounds to provide shade. Plant cuttings or seedlings widely spaced as the mature tree has a spreading crown. Improves soil fertility if interplanted with crops as it does not compete with them. Also planted as a live fence and for marking boundaries. It yields a white barkcloth. The latex has been used as a treatment against ringworm.  ", 
      "Uses": [
         "Poles", 
         "Shade", 
         "Soil conservation and improvement", 
         "Live fence", 
         "Boundary demarcation", 
         "Barkcloth"
      ]
   }, 
   "mukuzanyana": {
      "Description": "An understorey or canopy tree 7-12 m, but to 25 m in forest. It has a dense, shady, rounded crown (like mango).", 
      "Ecology": "A tree extending to southern Africa. It is found in evergreen lowland and upland forest in dry and moist areas of Eastern, Central and Western Uganda. Often a colonizer in secondary vegetation. Abundant in forests between Kyegegwa and Kyenjojo along the Kampala-Fort Portal road. ", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Mukuzanyana", 
         "Scientific_Name": "Blighia unijugata", 
         "Ugandan_Name": "Mukuzanyana"
      }, 
      "Parts": {
         "Bark": "thin, grey to dark green, rather smooth but with horizontal ridges and little rounded bumps.", 
         "Flower": "small, fragrant and white on a drooping head 7-8 cm. Male trees and female trees.", 
         "Fruit": "bright yellow- orange-red capsules decorate the tree, each soft, hairy, rather triangular to 4 cm long with 3 winged lobes. The fruit become woody and split into 3 sections each of which twists back to set free 1 cm shiny brown-black seeds. Each has a small yellow cup-like aril.", 
         "Leaves": "compound, only 1-3 pairs leaflets on a short stalk, dramatic pink-red at first, later shiny dark green, dull below. Each leaflet about 12 cm and quite wide, smaller leaflets at the base, the edge wavy and tip long and pointed.", 
         "Seeds": "Seeds are contained in a 3-sided capsule and germinate easily,"
      }, 
      "Propagation": "Seedlings (sow seed in pots) and wildlings", 
      "Remarks": "Leaves and fruit have been reported to be poisonous—not even eaten by baboons. The red heartwood has been used for building and furniture. Common as a shade tree in coffee plantations and suitable for commercial plantations.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Flooring", 
         "Shade"
      ]
   }, 
   "mulongo": {
      "Description": "A medium-sized deciduous tree with a straight trunk to 20 m and a flattened or layered crown.", 
      "Ecology": "A tree of Central and East Africa and the Sudan, found in upland rain forest, especially in gallery riverine forests. In Uganda it is a vigorous colonizer in woodlands, gallery and mixed forests and on forest edges. It prefers moist and wet sites. ", 
      "Names": {
         "English_Name": "Large-leaved albizia",
         "Primary_Name": "Mulongo", 
         "Scientific_Name": "Albizia grandibracteata", 
         "Ugandan_Name": "Mulongo"
      }, 
      "Parts": {
         "Bark": "fairly smooth, pale grey- brown. Young branchlets densely hairy.", 
         "Flower": "in colourful hemispherical heads, mostly pink with dark red anthers seen well beyond the petals.", 
         "Fruit": "flat, pale brown pods, narrow, to 15 cm with a small pointed tip. Dense papery bunches can be seen on bare trees, 5-8 seeds are set free when the pods split open.", 
         "Leaves": "bipinnate, on a stalk to 9 cm with only 2-3 pairs pinnae and 3-6 pairs leaflets, pink-red when young. The smallest leaflets at the base, terminal leaflets largest and reach 7 cm, rather curved and tip pointed. At the base of young leaves are rounded pink-green leafy stipules, to 2 cm long.", 
         "Seeds": "Collect in pods just before pods split open. Thresh pods and separate seeds. Seeds susceptible to attack by insects,"
      }, 
      "Propagation": "Seedlings, wildlings, and root suckers", 
      "Remarks": "A striking tree when in flower. The pale wood, although easily worked, is not very durable and is attacked by insects. In other properties it is similar to A. gummifera. The name grandibracteata refers to the \"large bracts\", leafy growths at the base of young leaves.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Furniture", 
         "Construction", 
         "Farm tools", 
         "Medicine", 
         "Bee forage", 
         "Ornamental", 
         "Mulch", 
         "Nitrogen fixation"
      ]
   }, 
   "musizi": {
      "Description": "A leafy semi-deciduous tree 10-30 m, often a clear bole to 10 m, the branches rather horizontal, the crown flattened when young but more rounded with age.", 
      "Ecology": "A large tree found in East, Central and West Africa in rain forest and riverine forest. In Uganda, it grows in low moist tropical forests, colonizing forest, forest edge and mixed forest, e.g. Budongo and Mabira.", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Musizi", 
         "Scientific_Name": "Maesopsis eminii", 
         "Ugandan_Name": "Musizi"
      }, 
      "Parts": {
         "Bark": "pale grey- brown, branchlets dotted with breathing pores, grooved with age.", 
         "Flower": "small and green in heads beside leaves.", 
         "Fruit": "oval, to 3 cm long, fleshy and yellow, turning purple, with 1-2 hard seeds.", 
         "Leaves": "appear compound but alternate on the twig, on stalks to 1 cm, each long and shiny, pointed, to 14 cm, the edge with characteristic well- spaced rounded teeth.", 
         "Seeds": "No. of seeds per kg: 500. Low germination rate (20-55%)."
      }, 
      "Propagation": "Seedlings (sow seed in pots), wildings, direct sowing at site", 
      "Remarks": "One of the quickest growing timber trees, maturing in 20 years. It is grown in pure stands, as an avenue tree and also intercropped with banana, coffee and cocoa. The timber is not resistant to fungi or termites so rots quickly. Hornbills and chimpanzees eat the fruit and disperse the seed. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Veneer/plywood", 
         "Fodder", 
         "Shade", 
         "Ornamental"
      ]
   }, 
   "mutuba": {
      "Description": "An evergreen shrub or tree usually 12 m but up to 30 m with upright branches to a dense drooping crown. Aerial roots may hang down from the branches and the base of the trunk is often a mass of interwoven roots.", 
      "Ecology": "A common African fig tree found from West to East, northern Zambia to South Africa. It grows in both wet and dry forest and thickets, in riverine and ground-water forests in higher rainfall woodland and savanna, 10-2,200 m. The tree has been cultivated in all regions of Uganda. It often begins life as an epiphyte then becomes a strangler and replaces the host tree, but may also be quite terrestrial. ", 
      "Names": {
         "English_Name": "Bark-cloth fig",
         "Primary_Name": "Mutuba", 
         "Scientific_Name": "Ficus natalensis", 
         "Ugandan_Name": "Mutuba"
      }, 
      "Parts": {
         "Bark": "pale grey, thin and smooth.", 
         "Flower": null, 
         "Fruit": "figs in pairs beside or just below leaves on stalks 2-10 mm, rounded yellow-red when ripe 8-18 mm across, 2 mm long, bracts at the base fall off (unlike F. tbonningii).", 
         "Leaves": "rather stiff, long oval, often wider at the tip, about 6 cm (2.5-10 cm) long, tip rounded or shortly pointed, 5-10 veins on either side, on a stalk 0.5-2.0 cm long.", 
         "Seeds": "Seed is contained in the figs which dry without releasing the seed. The figs should be crushed so the seeds are released before sowing in the nursery."
      }, 
      "Propagation": "Large cuttings, seedlings", 
      "Remarks": "Barkcloth used to be made from this tree throughout Uganda. A cylinder of bark is removed in one piece then softened with steam. An 18-inch strip of bark can be beaten with a mallet into a piece of cloth over 7 feet wide. Each household had its own trees and each tree could yield 40 bark strippings. The naked stem of the tree was immediately wrapped in banana leaves. The leaves are used to treat dysentery and sore throats. The tree is also grown as a live fence around homes and at a wide spacing for shade in coffee, cocoa and banana plantations.", 
      "Uses": [
         "Medicine", 
         "Shade", 
         "Live fence", 
         "Bark cloth"
      ]
   }, 
   "muwafu": {
      "Description": "A massive deciduous tree to 40 m, the straight bole often clear to 30 m. Large branches reach to a spreading rounded umbrella crown. In young trees branches are whorled, at right angles to the trunk and curve upwards. The base may have slight blunt buttresses and overground roots may spread out to 10 m from the tree base.", 
      "Ecology": "One of only two African species, this large tree is widely distrib- uted in Senegal, Sudan, south-west Ethiopia, Tanzania to Angola and Zambia. In Uganda, it is common in Kalinza Forest Reserve, and in the forests around Lake Victoria and Kampala city. Often an isolated tree in cleared land, especially in Jinja, Kamuli and Iganga Districts, rare in Ankole and Kigezi. Rainfall 900-1,400 m. ", 
      "Names": {
         "English_Name": "incense tree",
         "Primary_Name": "Muwafu", 
         "Scientific_Name": "Canarium schweinfurthii", 
         "Ugandan_Name": "Muwafu"
      }, 
      "Parts": {
         "Bark": "thick and rough, grey-red-brown, flaking in pieces up to 30 by 10 cm. Young branchlets hairy red-brown. When cut the fragrant resin smells of incense.", 
         "Flower": "cream- white in axillary sprays to 30 cm long, 3 petals and a 3-part calyx, funnel shaped with rust-red hairs inside and out.", 
         "Fruit": "smooth and oblong, soft and purple when ripe, 2.5-4.0 cm long. A 3-ridged stone inside as long as the fruit, eventually splits to release 3 seeds. ", 
         "Leaves": "odd pinnate tufted at the ends of branches, usually 6-10 pairs of leaflets plus 1, each with a short stalk, oval to oblong, stiff, long pointed to 15 cm, base rounded, about 15 pairs side veins, vein network dense below, surface dull green-brown with a few hairs but more hairy below, especially on veins.", 
         "Seeds": "The fruit fall to the ground when ripe. Collect together and allow the outer coat to decompose, then separate the stones,"
      }, 
      "Propagation": "Seedlings, wildlings, direct sowing on site", 
      "Remarks": "Does not compete with crops. Has been planted in rows for reforestation. In Jinja, Kamuli and Iganga the tree is much liked for its fruit which are lightly boiled and the outer coat eaten with a sprinkle of salt. The wood is suitable for construction work but needs to be seasoned with care. It is an excellent shade tree and the resin is used as an incense.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Veneer", 
         "Fruit", 
         "Shade", 
         "Ornamental", 
         "Incense"
      ]
   }, 
   "muziru": {
      "Description": "A large spreading tree 10-14 m, the bole short (3-18 m), up to 2 m in diameter and strongly buttressed, the trunk often irregular, twisted, the branches growing near the base and often covered with other plants.", 
      "Ecology": "A large African tree from Senegal to the Sudan, south to Angola and Zambia. In Uganda, it is widespread and often abundant growing on lake shores, at rain-forest edges and in swampy areas in tropical forests and near streams.", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Muziru", 
         "Scientific_Name": "Pseudospondias microcarpa", 
         "Ugandan_Name": "Muziru"
      }, 
      "Parts": {
         "Bark": "smooth and thin when young, becoming yellow-grey and rough, flaking in large pieces.", 
         "Flower": "in loose heads, 10-32 cm, beside leaves, the stalks dull red-brown, very small white male and female flowers, parts in fours.", 
         "Fruit": "a soft edible drupe to 2.5 cm, blue-black when ripe, the stone inside is 4-sided and contains the seeds.", 
         "Leaves": "odd pinnate on stalks to 30 cm, with 2-8 pairs leaflets plus 1, each leaflet stalked, rather stiff, oval 5-20 cm, base very unequal, tip long pointed, darker above than below. Basal leaflets the smallest.", 
         "Seeds": "Drupes produced in big numbers."
      }, 
      "Propagation": "Seedlings (sow in pots), wildlings", 
      "Remarks": "Brickworks operating near swamp forests have destroyed many of these trees. Plant individual trees for their fruit or many to protect stream banks and regulate water flow in swamps and rivers. In West Africa the seeds are used for making beads. The resinous bark is used to treat jaundice and eye conditions. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Food", 
         "Medicine", 
         "Soil and water conservation"
      ]
   }, 
   "muvule": {
      "Description": "Old trees may have a straight trunk clear to 21 m and 2 m in diameter. The high umbrella crown grows from a few thick branches. Ultimate branches hang down (only female trees; male individuals have upright branches).", 
      "Ecology": "A giant deciduous tree of lowland forest and wet savannah that is logged commercially throughout its range. Widespread throughout tropical Africa, Ivory Coast to Angola, Sudan to Mozambique. It can grow well with mean annual rainfall as low as 700 mm provided it has access to extra water from a perennial stream or underground. It does not tolerate waterlogging and the soils must be well drained and relatively fertile. In Uganda, it is abundant in Jinja, Kamuli and Iganga Districts, though it occurs in most Districts of the country.", 
      "Names": {
         "English_Name": null,
         "Primary_Name": "Muvule", 
         "Scientific_Name": "Milicia excelsa", 
         "Ugandan_Name": "Muvule"
      }, 
      "Parts": {
         "Bark": "thick, pale, grey then brown, exudes slightly milky sap, as do the leaves.", 
         "Flower": "trees are male or female, both with small flowers in spikes, male flowers in drooping catkins to 15 cm, female shorter and thicker.", 
         "Fruit": "like a long, green mulberry, 6-7 cm, the soft pulp attracting birds and bats. Fruits ferment rapidly on the ground. Small hard seeds lie in the pulp.", 
         "Leaves": "large, oval to 18 cm, rather thin, a well-pointed tip, 10-18 pairs clear side veins, base rounded, often unequal sided, stalk to 4 cm, leaf edge finely toothed and wavy.", 
         "Seeds": "No. of seeds per kg: about 475,000. The tree produces plenty of seeds in Uganda, and seed collection is not difficult. Collect the whole fruit, crush and float in water. Seeds sink and can easily be separated."
      }, 
      "Propagation": "Seedlings, stumps, wildlings", 
      "Remarks": "The wood is hard, durable and termite resistant and resembles teak. Therefore, it is extremely valuable timber, used especially for quality indoor and outdoor furniture. In Kenya, the species is now rare and endangered. Trees planted 50 years ago in Uganda are now ready to harvest. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Shade", 
         "Ornamental", 
         "Mulch", 
         "Soil conservation"
      ]
   }, 
   "norfolk island pine": {
      "Description": "It is a slow growing tree, reaching a height of 50–65 m, with straight vertical trunks and symmetrical branches, even in the face of incessant onshore winds that can contort most other species.", 
      "Ecology": "Norfolk Island pine is endemic to lowland areas of Norfolk Island. It is widely planted as an ornamental and avenue tree throughout the subtropics and tropics.In Uganda it s usually grown as an ornamental tree in public parks and even compounds in either pots or on ground. Growth rate is reported as being fast, however will be dependent on nursery production method, landscape site conditions and after-care maintenance. In Kampala, Norfolk Island pine can be found within Makerere University, Kitante courts, Sheraton gardens, along Clement hill road, Nakasero hill road among other places.", 
      "Names": {
         "English_Name": "Norfolk Island pine", 
         "Primary_Name": "Norfolk Island Pine", 
         "Scientific_Name": "Araucaria heterophylla", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "Gray-brown, falls off in fine scales. From the straight trunk, it emits its branches almost horizontal or slightly oblique, in number of five, forming floors; the plane of each floor is a perfect pentagon.", 
         "Flower": null, 
         "Fruit": "has squat globose cones, 10–12 cm long and 12–14 cm diameter, and take about 18 months to mature. They disintegrate at maturity to release the nut-like edible seeds. ", 
         "Leaves": "soft and awl-shaped, 1–1.5 cm long, about 1 mm thick at the base on young trees, and incurved, 5–10 mm long and variably 2–4 mm broad on older trees.", 
         "Seeds": "The seeds have a length of 2.5 to 3 cm and a diameter of about 1.2 cm with wide wings. There are four cotyledons present."
      }, 
      "Propagation": "Seedlings\nSeed: The seeds have a length of 2", 
      "Remarks": "The distinctive appearance of this tree, with its widely spaced branches and symmetrical, triangular outline, has made it a popular cultivated species, either as a single tree or in . ", 
      "Uses": [
         "Firewood", 
         "Timber", 
         "Christmas trees", 
         "Sapling", 
         "House ornamental"
      ]
   }, 
   "paper mulberry": {
      "Description": "A   growing up to 15 metres tall, sometimes higher in ideal conditions.", 
      "Ecology": "Locations within which Paper Mulberry is  include Latin America, the United States, south and west Asia and Africa. Paper Mulberry is invasive in parts of Uganda.", 
      "Names": {
         "English_Name": "Paper Mulberry", 
         "Primary_Name": "Paper Mulberry", 
         "Scientific_Name": "Broussonetia papyrifera", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "composed of very strong fibres, and can be used for making high-quality paper (hence the common name of paper or pulp mulberry).", 
         "Flower": "male (staminate) flowers are produced in an  , and the female (pistillate) flowers in a  .", 
         "Fruit": "the pistillate flower matures into a red to orange fruit 3-4 cm in diameter", 
         "Leaves": "variable in shape (even on the same branch), unlobed egg-shaped with broad end at base (), (heart-shaped) to deeply . They are 7-20 cm long, with a rough surface above, fuzzy-downy below and a finely  margin.", 
         "Seeds": "Controlling the  before it seeds will reduce future problems"
      }, 
      "Propagation": "Seedlings", 
      "Remarks": null, 
      "Uses": [
         "Firewood", 
         "Paper", 
         "Deer food", 
         "Timber", 
         "Cloth\n\ndescription: a   growing up to 15 metres tall", 
         "Sometimes higher in ideal conditions"
      ]
   }, 
   "parasol": {
      "Description": "A deciduous tree to 25 m with a straight slender bole to about 9 m before the development of whorls of branches, like spokes of an umbrella, supporting a flat-topped crown.", 
      "Ecology": "A tall forest tree widely distributed in wetter highland forests into the bamboo zone and growing as far south as South Africa. In Uganda it grows in woodland and semi-humid and humid highland forests with Syzygium, Cordia, Olea, Apodytes and Aningeria. Abundant in colonizing and riverine forest. Absent from Bunyoro it is widespread elsewhere in Uganda. It requires light and may be abundant at forest edges.", 
      "Names": {
         "English_Name": "Parasol", 
         "Primary_Name": "Parasol", 
         "Scientific_Name": "Polyscias fulva", 
         "Ugandan_Name": "Setala"
      }, 
      "Parts": {
         "Bark": "grey, smooth, leaf scars prominent, flaking on older trees.", 
         "Flower": "green-yellow, honey scented, very small in loose much-branched heads to 60 cm, main stalks with red-brown scales.", 
         "Fruit": "each fruit is small, black, oval, often ribbed, closely clustered on the branches.", 
         "Leaves": "compound, pinnate, to 1 m with 9-13 pairs of leaflets plus one at the tip, each leaflet oval and leathery, 9-20 cm, base rounded, covered with cream-yellow hairs below.", 
         "Seeds": "Seed can be collected from the ground. Another method is to collect fruit immediately they turn purple-black by climbing the tree. Let seed mature in the shade 1-2 days then extract by soaking in cold water for 4-6 hours, squeeze out and separate by floating in water, then dry in the shade. No. of seeds per kg: about 310,000. Germination 75% in 35-45 days,"
      }, 
      "Propagation": "Seedlings, wildlings", 
      "Remarks": "The very light soft pale-coloured wood is tough and strong and good for food containers as it has no smell. It has been used to make drums and even shingles, but it is mainly used for beehives, especially in Ruwenzori where one Konjo family may have up to 100 hives. The leaf fall makes good mulch. The tree is also suitable for intercropping with banana, coffee or cocoa. ", 
      "Uses": [
         "Firewood", 
         "Timber", 
         "Boxes", 
         "Crates", 
         "Carving", 
         "Utensils", 
         "Musical instruments", 
         "Beehives"
      ]
   }, 
   "pheasant-berry": {
      "Description": "A deciduous tree 4-25 m high, very variable depending on the habitat. Usually branched near the base, a spreading and drooping branchlets. Branches on young trees are at right angles to the trunk.", 
      "Ecology": "A widespread African tree of moist or dry forest margins, often a pioneer of lowland forest (Sudan), becoming dominant and then dying out. In Uganda it grows in thickets in savanna, secondary scrub and on forest edges.", 
      "Names": {
         "English_Name": "Pheasant-berry", 
         "Primary_Name": "Pheasant-berry", 
         "Scientific_Name": "Margaritaria discoidea", 
         "Ugandan_Name": "Kamenyambazi"
      }, 
      "Parts": {
         "Bark": "thin, smooth grey-brown, slightly fissured becoming rough and fibrous and scaling in big pieces with age.", 
         "Flower": "male and female trees, flowers, small and inconspicuous, green-yellow and fragrant, appear on the bare tree.", 
         "Fruit": "yellow-brown 3-part capsule 1 cm or less, breaking open to set free 3 blue-black metallic-shiny seeds.", 
         "Leaves": "simple, alternate, sometimes appear compound on young shoots, variable in size, oval bright green and thin, about 10 cm, veins indistinct, edge of leaf clear when held up to the light.", 
         "Seeds": "Seeds prolifically. Unopen capsules can be collected from under the mother tree, then crushed and the seeds separated from the chaff."
      }, 
      "Propagation": "Seedlings, wildlings, direct sowing at site", 
      "Remarks": "This is a suitable tree for forest plantations and woodlots in northern Uganda. It has been grown together with Markhamia lutea in the Northern Region. The timber is hard and heavy. Coppice shoots make good building poles. The synonym is Phyllanthus discoideus.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Cabinet work", 
         "Poles"
      ]
   }, 
   "pitanga cherry": {
      "Description": "An evergreen shrub or small tree 2-3 m high.", 
      "Ecology": "A native of South America introduced to Uganda. Often found near church missions.", 
      "Names": {
         "English_Name": "Brazil cherry", 
         "Primary_Name": "Pitanga Cherry", 
         "Scientific_Name": "Eugenia uniflora", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "brown.", 
         "Flower": "small and solitary with numerous white stamens.", 
         "Fruit": "bright red when ripe. The soft edible fruit is rounded and ridged to 2.5 cm across with hard smooth round seeds inside.", 
         "Leaves": "simple and opposite, shiny dark green, oval and pointed, quite small. New leaves deep purple-red.", 
         "Seeds": "Squash fruit and separate seeds."
      }, 
      "Propagation": "Seedlings", 
      "Remarks": "It is widely cultivated in the tropics, including Uganda, as a hedge. The leaves are aromatic when crushed and are said to repel flies. The fruit are juicy and used to make jelly and jam. Plant as an orchard tree, as a hedge or as an ornamental.", 
      "Uses": [
         "Food", 
         "Fruit", 
         "Ornamental", 
         "Live fence"
      ]
   }, 
   "podo": {
      "Description": "A forest tree to 35 m, evergreen, conical in shape when young, the trunk large and buttressed in old trees.", 
      "Ecology": "The natural range of P. latifolius is from Kenya through Central Africa to South Africa. It requires deep, fertile and well-drained soil, usually in wet montane climates, 900-3,200 m. In Uganda, it grows in the Sango Bay and Impenetrable (Bwindi) Forests, the Ruwenzori mountains, Mt. Elgon and the Imatong Mountains (in Kitgum District) which extend into the Sudan.", 
      "Names": {
         "English_Name": "Podo", 
         "Primary_Name": "Podo", 
         "Scientific_Name": "Podocarpus milanjianus", 
         "Ugandan_Name": "Musenene"
      }, 
      "Parts": {
         "Bark": "red-brown to grey-brown, narrowly fissured, peeling in long fibrous strips.", 
         "Flower": null, 
         "Fruit": "male trees have small pinkish catkins with pollen, to 5 cm; female trees produce soft fleshy \"fruit\" about 1 cm, ovoid, the thin leathery skin green-purple with a grey bloom. The receptacle stalk below the fruit is characteristically swollen, soft and red, 1-2 cm, soon falling (podocarpus means \"fruit with a stalk or foot\"). ", 
         "Leaves": "spirally arranged at the tips of branches, very shiny, curved, tough, to 15 cm, with a pointed tip, larger and fresh green colour when young.", 
         "Seeds": "The inner shell of the receptacle is thin and woody containing 1-2 woody seeds"
      }, 
      "Propagation": "Direct sowing on site, wildlings and seedlings", 
      "Remarks": "The species will grow well in all high-rainfall areas of Uganda both at low and high altitudes. It is a high-class soft wood, considerably superior to European soft woods. Can be grown in forest plantations similar to pines, as avenue trees or intercropped for shade in banana, coffee and cocoa plantations.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Joinery wood", 
         "Panel framing", 
         "Panels", 
         "Shade in plantations", 
         "Ornamental"
      ]
   }, 
   "queensland umbrella": {
      "Description": "Medium-sized evergreentree, up to 15 m tall in natural habitat but only 8 m under cultivation, with single or multi-stemmed trunks.The thick branches are marked by conspicuous leaf-scars when they are young. They are dark green in color, and covered with whitish spots (i.e. lenticels).", 
      "Ecology": "Schefflera actinophylla is native to northern Australia and southeastern New Guinea. A weed of closed forests, rainforests, open woodlands, waterways (i.e. riparian areas) and coastal environs in these areas. It is shade tolerant and invades disturbed or undisturbed forests and coastal bushland.It is widely grown in temperate climates as an ornamental houseplant. ", 
      "Names": {
         "English_Name": "Queensland umbrella tree", 
         "Primary_Name": "Queensland Umbrella tree", 
         "Scientific_Name": "Schefflera actinophylla", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "greenish, older trunksingreyish or greyish-brown in color and relatively smooth.", 
         "Flower": "borne in dense clusters 10 - 15 stiff and long stalks radiating from a single point, up to 60 cm in length that form a large, red, showy inflorescence at stem tips above foliage. Individual flowers red and small, 0.6 cm wide, bisexual, fragrant with 11 petals, 11 stamens and no sepals.", 
         "Fruit": "rounded to 5 mm across, lightly ribbed, light green then red when ripe, topped by the remains of 5 styles. ", 
         "Leaves": "alternate with petioles up to 61 cm long, compound palmate, 7 - 16 stalks leaflets arranged in a whorl, leathery, oblong - elliptic in shape, shiny, light green, oblanceolate, up to 30 cm long, and entire margins (or sparsely toothed when young).", 
         "Seeds": "purplish black, round, fleshy drupes up to 7 mm in diameter, containing up to 8 seeds.."
      }, 
      
      "Propagation": "Cuttings, wildings, seedlings", 
      "Remarks": "The tapped resin is used as a medicine for whooping cough. Individual trees can be intercropped with coffee or banana or planted for shade and as avenue trees; also in pots for house decoration.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Medicine", 
         "Shade", 
         "Ornamental"
      ]
   }, 
   "raffia palm": {
      "Description": "A massive palm growing in clusters in swamp forest, reaching 25 m but usually much less; the trunk 60 cm or more across and to 10 m high, covered with large leaf bases, old rotting ones, plant debris and epiphytes.", 
      "Ecology": "A palm tree which grows in East Africa and throughout southern tropical Africa. It is widespread in riverine forest and freshwater swamp forest and is frequently cultivated. In Uganda it grows in low-lying wet places and along river banks, especially in the wetter forests of the Lake Victoria belt. ", 
      "Names": {
         "English_Name": "Raffia palm", 
         "Primary_Name": "Raffia Palm", 
         "Scientific_Name": "Raphia farinifera", 
         "Ugandan_Name": "Kibo"
      }, 
      "Parts": {
         "Bark": "Brown and made of strong fibre used in ropes, twines, etc.", 
         "Flower": "male and female flowers on the same plant grow in massive hanging heads from the stem apex, to 3 m x 35 cm. After flowering the plant dies, often the majority in an area dying in the same year.", 
         "Fruit": "shiny orange- brown and ovoid (like a cone), about 10 cm long by 5 cm across, with 12-13 rows of tightly packed convex scales. Inside is an oily layer and one seed about 5 cm long, shaped as the fruit.", 
         "Leaves": "pinnate and erect, only slightly spreading to 8 m long, usually less, the base sheathing the stem. The leaf stalk very strong, orange-brown to crimson when young, cylindrical to 1.5 m long and 20 cm diameter at the base, narrowing to 12 cm across where leaflets arise. 150 or more leaflets grow in 2 planes, each to 1 m long, 8 cm wide, edged with little spines, hardly drooping or rather stiff. Leaflets cross-section (reduplicate).", 
         "Seeds": "The large seeds can be collected under old trees"
      }, 
      "Propagation": "Seedlings (sow seeds in pots) and wildlings", 
      "Remarks": "Raffia plants have some of the biggest leaves in the plant king- dom. This species is quickly disappearing as its habitat is being destroyed. The outer skin of young leaflets is stripped off and makes excellent fibres for ropes and baskets—the raffia of commerce. The strong midrib is used locally for rafters, chairs, ladders, etc. The palm can be grown as individual plants or in a plantation. It can also grow on raised ground provided there is good moisture in the soil.", 
      "Uses": [
         "Fibres", 
         "Ropes", 
         "Baskets", 
         "Furniture", 
         "Leaf stalks", 
         "Decoration", 
         "Thatch"
      ]
   }, 
   "red mahogany": {
      "Description": "A semi-deciduous forest tree to 60 m, often a straight bole to 30 m before branching to a massive crown (branching lower down if riverine), large trees with prominent surface roots and buttresses 4-6 m. The bole may reach 4 m in diameter above the buttresses.", 
      "Ecology": "A tall timber tree of tropical rain forests from Tanzania south to Mozambique at medium to low altitudes, often riverine. In Uganda, it occurs in Budongo, Bugoma and Semliki Forests in the Western Region. At one time it provided half the total timber taken from Budongo Forest. It does best in deep fertile soils with subsoil moisture and can withstand seasonal flooding. ", 
      "Names": {
         "English_Name": "Red mahogany", 
         "Primary_Name": "Red Mahogany", 
         "Scientific_Name": "Khaya anthotheca", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "grey, smooth but with shield-like scars from flakes 3 cm across, the surface \"pock marked\" grey and brown.", 
         "Flower": "small, 1 cm, white and sweet- scented in heads, often hidden among the leaves.", 
         "Fruit": "a dry capsule about 5 cm across, grey brown, breaks into 4-5 sections, rather flower-shaped, on the tree, scattering 30-60 pale, flat winged seeds. The capsule is a uniform chocolate-brown inside. ", 
         "Leaves": "even pinnate to 30 cm with 2-7 pairs of oblong leaflets, each stiff to 17 cm, shortly stalked. Leaves clustered at branch ends. New leaves pink-brown.", 
         "Seeds": "The capsules are very high up on the mother trees and the seeds are widely scattered when they split. No. of seeds per kg: about 3,600. Seeds are best sown in seed beds,"
      }, 
      "Propagation": "Seedlings (sow seed in pots), wildlings", 
      "Remarks": "Uganda mahogany is of a high grade and occupies a basic position in the timber trade of East Africa. The pale pink fresh timber turns red-brown and is easy to work. It is suitable for joinery, decorative furniture, etc. It should be encouraged for planting along river banks and in degraded forest areas. It is also good for shade, doing well as an avenue tree. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Shade", 
         "Ornamental"
      ]
   }, 
   "red nongo": {
      "Description": "A deciduous tree, usually 20 m (9-30 m) with a spreading crown of layered foliage, the trunk often crooked.", 
      "Ecology": "A tree widespread in tropical Africa from Senegal to the Sudan and into Zaire, found in lowland rain forest, riverine forest and woodlands. A typical secondary-forest tree in West Africa, it is also found in thickets and on forest edges in most areas of the wetter savannah of Uganda, 915-1,370 m. ", 
      "Names": {
         "English_Name": null, 
         "Primary_Name": "Red Nongo", 
         "Scientific_Name": "Albizia zygia", 
         "Ugandan_Name": "Mulongo"
      }, 
      "Parts": {
         "Bark": "smooth when young, mature trees with thick brown bark, scaly or cracked. When cut the outer layer looks like orange peel. Young branchlets not densely hairy (as in A. grandibracteata).", 
         "Flower": "In half-spherical heads about 2 cm across with differently coloured male and female flowers, white- pink, the red stamen tubes hanging out 1-2 cm beyond the corolla.", 
         "Fruit": "Flat, papery, dull orange-red-brown pods about 10 x 2 cm (up to 18 x 4 cm) containing 9-12 oval flat seeds about 1 cm across. ", 
         "Leaves": "Bipinnate, usually with 3 clear pairs of pinnae (3-5) and 2-5 pairs leaflets on stalks about 9 cm long. The end leaflets longest, 3-7 cm, and the basal leaflets are the smallest, 1 cm. Leaflets are widest at the tip, usually blunt (pointed in A. grandibracteata). Young leaflets have narrow, leafy stipules at the base.", 
         "Seeds": "When pods split open the seeds stick on the sides of the pods and are carried away by the wind. Collect pods just before splitting open."
      }, 
      "Propagation": "Seedlings, wildlings", 
      "Remarks": "Farmers preserve this tree in fields as a host for climbing vines, e.g. yams. It does not compete with food crops. It is a useful timber for indoor construction work and furniture but is not termite proof or durable out of doors", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Shade", 
         "Ornamental", 
         "Nitrogen fixation"
      ]
   }, 
   "sausage tree": {
      "Description": "A semi-deciduous tree with a rounded crown, to 9 m in open woodland but 18 m beside rivers.", 
      "Ecology": "A tree widespread in Africa, found in wet savannah and along rivers in moist forests 1,100-3,000 m.", 
      "Names": {
         "English_Name": "Sausage tree", 
         "Primary_Name": "Sausage tree", 
         "Scientific_Name": "Kigelia africana", 
         "Ugandan_Name": "Mussa"
      }, 
      "Parts": {
         "Bark": "grey-brown, smooth, flaking in round patches with age.", 
         "Flower": "on long rope-like stalks 2-3 m. Horizontal, reddish branches, in threes, bear upturned trumpet-like flowers, petals folded and wavy, dark maroon with heavy yellow veins outside, and unpleasant smell.", 
         "Fruit": "large grey-green \"sausages\", 30-60 cm long. Hanging stalks remain on the tree. Several kilos of fibrous pulp contain the seeds—only released when fruit rots on the ground.", 
         "Leaves": "compound, growing in threes, at the end of branches, few leaflets, each broadly oval, very rough and hard, up to 10 cm, often with a sharp tip, edge wavy.", 
         "Seeds": "Not a prolific seeder. Poor germination rate and slow to germinate. No. of seeds per kg: 3,400-6,000."
      }, 
      "Propagation": "Seedlings, wildlings", 
      "Remarks": "Unripe fruit are poisonous. The tree does not compete with crops. In Uganda, Kigelia africana is conserved around homes and gardens for medicinal purposes.", 
      "Uses": [
         "Firewood", 
         "Timber", 
         "Dugout canoes", 
         "Medicine", 
         "Dye", 
         "Local honey beer"
      ]
   }, 
   "soursop": {
      "Description": "A slender evergreen tree 5-7 m in height, usually less, with a bole which may be 30 cm in diameter, the branches very low and wide, giving an open shady crown. In drought conditions it may lose all its leaves.", 
      "Ecology": "An exotic fruit tree planted throughout the warm tropical lowlands. One of several Annona, this species has the largest fruit, 1-4 kg in weight, but normally much less. Introduced to Uganda it is grown in mixed orchards or individually. Most common in Central Region but nowhere planted as a single orchard crop.", 
      "Names": {
         "English_Name": "Soursop", 
         "Primary_Name": "Soursop", 
         "Scientific_Name": "Annona muricata", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "grey with a pattern of shallow grooves.", 
         "Flower": "solitary and large, 2-5 cm across, often opposite leaves and hanging down, 3 outer fleshy petals, curved, almost triangular, 3 inner yellow-green petals, thinner and rounded, edges overlapping.", 
         "Fruit": "kidney or heart-shaped to 25 cm long, the leathery dark green skin covered with soft curved spines. Inside woolly white fibrous pulp covers many large brown-black seeds. The fleshy receptacle and fruit walls are edible and have a distinctive acid-sweet taste. (Single fruits grow together making one \"compound\" fruit, but the outline of individual fruits can be seen on the skin, each with its own spine. As pollination is often incomplete the fruit may have a distorted shape.) ", 
         "Leaves": "alternate, dark green, shiny and leathery 8-15 cm long, oval with a sharp tip, dull or yellowish below where there are small pits in vein axils. Crushed leaves have a strong, unpleasant smell.", 
         "Seeds": "Sow seeds in pots."
      }, 
      "Propagation": "Seedlings, grafting and budding", 
      "Remarks": "This is a desirable tree in home gardens as the delicious fruit can earn good cash and can be used for juice and ice-cream. However, one tree rarely produces more than a dozen fruit, which take 3 months to ripen, and are often attacked by birds such as mouse- birds. All parts have insecticidal properties and can be used to kill fish—a fruit can be used as bait. A powder or oil from the seeds has been used to kill lice and bedbugs. Contact with the eyes causes great irritation. It may be attacked by mealy bugs and scaly insects resulting in a reduction of yield or even complete failure.", 
      "Uses": [
         "Fruit", 
         "Drink", 
         "Medicine", 
         "Ornamental", 
         "Insecticide", 
         "Fish poison"
      ]
   }, 
   "star fruit": {
      "Description": "A small tree but up to 7-10 m with dense branching to an upright rounded crown.", 
      "Ecology": "A small fruit tree now widely cultivated in the wetter tropics from West Africa to Florida and Queensland. A recent import to Europe where its decorative star fruit is valued. It is cultivated in some Uganda gardens. A. bilimbi is a similar tree. ", 
      "Names": {
         "English_Name": "Star fruit", 
         "Primary_Name": "Star Fruit", 
         "Scientific_Name": "Averrhoa carambola", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "small, bushy evergreens with drooping branches.", 
         "Flower": "white or mauve in little cluster which grow out of the main trunk, and woody branches all over the tree.", 
         "Fruit": "oblong and fleshy, about 10 cm long, strongly 5-angled (star- shaped when cut), yellow-orange and crisp when ripe. They look like wax the watery pulp acid sweet tasting something between apricot and passion fruit.", 
         "Leaves": "pinnate with 5-11 pairs of pale green leaflets, each oval about 1.5 cm, folding up when touched.", 
         "Seeds": "Extracted by crushing the fruit and hand picking the seeds. Seed can be obtained from Entebbe Botanical Gardens and Kampala city gardens."
      }, 
      "Propagation": "Seedlings (sow seeds in pots), root suckers or direct sowing on site", 
      "Remarks": "Fruits are acidic but can be made into a pleasant drink or jelly. The juice removes stains from linen. Makes a handsome ornamental, so plant as a border or avenue tree. The timber is also useful.", 
      "Uses": [
         "Fruit", 
         "Drink", 
         "Jelly", 
         "Detergent"
      ]
   }, 
   "terminalia": {
      "Description": "A shapely tree to about 10 m, with leafy horizontal branches.", 
      "Ecology": "A tree from Madagascar, now very popular in East Africa, especially Kenya. It has recently been introduced to Uganda and has gained popularity as an ornamental. It has been planted around Parliament buildings and along some streets in Kampala. It grows well in good soil and is drought resistant once estab- lished. Since the tree rarely flowers at high altitudes, seed is collected from trees in hotter low areas. ", 
      "Names": {
         "English_Name": "Terminalia", 
         "Primary_Name": "Terminalia", 
         "Scientific_Name": "Terminalia mantaly", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "pale, grey, smooth.", 
         "Flower": "small, green in erect spikes to 5 cm long.", 
         "Fruit": "small green and oval to 1.5 cm with no obvious wings.", 
         "Leaves": "in terminal rosettes of 4-9 unequal leaves on short thickened stalks, up to 7 cm, tip rounded, edge wavy, bright green when young.", 
         "Seeds": "Easily collected."
      }, 
      "Propagation": "Seedlings", 
      "Remarks": "Seedlings of this species fetch good prices.", 
      "Uses": [
         "Shade", 
         "Ornamental"
      ]
   }, 
   "tipu": {
      "Description": "A large, spreading, semi-deciduous shade tree to 20 m, but occasionally to 30 m, with a light spreading crown.", 
      "Ecology": "An attractive flowering tree whose natural range is Brazil and the mountain forests of Bolivia. Now widely planted from the Mediterranean to the tropics. It is drought resistant, tolerating a wide variety of soils including black-cotton. In Uganda, it will grow at altitudes from 1,200 to 2,200 m. ", 
      "Names": {
         "English_Name": "Pride of Bolivia", 
         "Primary_Name": "Tipu", 
         "Scientific_Name": "Tipuana tipu", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "red-brown trunk, fissured and flaking with age, bark on the branches grey and cracked, sap from cut branches red and sticky.", 
         "Flower": "very many in long, loose sprays, each with wavy yellow- orange petals.", 
         "Fruit": "unusual for legume family, the only genus with single-seeded, flat-winged fruit, yellow-green at first, looking like blossoms, later grey-brown, fibrous, staying on the tree for a long time. ", 
         "Leaves": "compound, alternate leaflets light green, each narrowly oblong to 5 cm, tip round, often notched, on a short stalk.", 
         "Seeds": "No. of seeds per kg: 1,600-2,700. Germination rate 90% and over"
      }, 
      "Propagation": "Seedlings (sow seed in pots), wildlings, direct sowing on site", 
      "Remarks": "The tree is shallow rooted and so it should not be planted too close to buildings as it is likely to be blown over by wind. It can produce useful poles. The tree is not yet common in Uganda, but has been planted at Makerere University campus where it seeds well. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Bee forage", 
         "Shade", 
         "Ornamental", 
         "Nitrogen fixation"
      ]
   }, 
   "toddy palm": {
      "Description": "A very tall, single-stemmed evergreen palm tree that can eventually reach a height of 30 metres. The unbranched stem can be up to 1-metre-wide at the base, narrowing to 40 - 50cm at around 4 metres and thereafter cylindrical; it is topped by a crown of up to 60 large, stiffly projecting fan-shaped-leaves.", 
      "Ecology": "Native to South and Southeast Asia, in the Indomalaya ecozone. Palmyra palm occurs in hot, dry, monsoonal areas in both forested and open country, often forming large stands. Though a very adaptable palm, it prefers an open, sunny aspect and well-drained, sandy soils near the tropical coast. It is fairly tolerant to drought and water-logging. Does not transplant well and greatly resent to disturbance, thus seeds are best sown in their permanent position.In Kampala, this palm can be found within Makerere University, Uganda Golf course, National housing & Medical quarters among other places.", 
      "Names": {
         "English_Name": "Toddy palm", 
         "Primary_Name": "Toddy Palm", 
         "Scientific_Name": "Borassus flabellifer", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "black, rough, ringed with old leaf scars, often bear a dead skirt of dried fronds beneath the crown; crownshaft absent.", 
         "Flower": "Inflorescences multi-branched, interfoliar, cream, shorter than the fronds; female inflorescences unbranched or branched with first order, up to 0.3 m long, covered with sheath-like bracts; male inflorescences massive, up to 2 m long, female flowers 2.5 cm in diameter; male flowers 2 cm in diameter.", 
         "Fruit": "broadly ovoid, 15 to 20 cm in diameter, 1.5 to 2.5 kg in weight, black, fibrous, fleshy, often fragrant, 1 to 3-seeded. ", 
         "Leaves": "fronds fan-shaped, rigid, greyish-green, large (up to 3 m across), induplicate (having its margins folded inwards); petiole semi-terete (having a circular transverse section), 0.6 to 1.2 m long, armed with hard, coarse, irregular spines along both edges.", 
         "Seeds": null
      }, 
      "Propagation": "Seeds", 
      "Remarks": "Mainly cultivated in the drier parts of its geographical range, where the sugar palm (Arenga pinnata) and the coconut (Cocos nucifera) cannot compete. The lowest 10 metres of the trunk has a hard and strong wood that is heavy, very durable and very resistant to termites, insect borers and decay fungi.", 
      "Uses": [
         "Food", 
         "Drink", 
         "Palm wine", 
         "Oil", 
         "Thatching"
      ]
   }
}