{
   "african-blackwood": {
      "Description": "A much-branched spiny shrub or well-branched tree, to 7 m. Diameter no more than 20-30 cm, often twisted. Grey-white spine-tipped branchlets bear the leaves.", 
      "Ecology": null,
      "ImageUri": "https://www.ourbreathingplanet.com/wp-content/uploads/2018/07/1-46.png", 
      "Names": {
         "English_Name": "African blackwood", 
         "Scientific_Name": "Dalbergia melanoxylon", 
         "Ugandan_Name": "Motangu"
      }, 
      "Parts": {
         "Bark": "light grey and smooth when young, rough and flaking with age.", 
         "Flower": "small, white, sweet-scented, in branched sprays to 12 cm long.", 
         "Fruit": "bunches of grey pods, thin and flat to 7 cm, pointed both ends, 1-2 seeds inside.", 
         "Leaves": "compound on stalks to 20 cm, leaflets 9-13, each 1-2 cm, tip rounded or notched.", 
         "Seeds": "No. of seeds (with pods) per kg: 6,000-16,000. Germination 50-60% in 8-20 days. Water sparingly so the seed does not rot. No. of clean seeds extracted from pods is about 42,000 per kg. "
      }, 
      "Propagation": "Seedlings, wildings, cuttings, root suckers", 
      "Remarks": "Farmers should be encouraged to grow this tree as a long-term investment. The very hard, durable, termite-resistant, purple-black heartwood is used for carvings. The hard wood blunts tools so it cannot be used for furniture. Pieces of high-quality heartwood are exported from Tanzania to Europe to make valuable musical instruments. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Carving (musical instruments", 
         "Walking sticks", 
         "Etc"
      ]
   }, 
   "caribbean-pine": {
      "Description": "An evergreen tree with a straight bole and regular spreading crown up to 30 m high. The bole can reach over 1 m in diameter.", 
      "Ecology": null,
      "ImageUri": "https://bugwoodcloud.org/images/768x512/5579275.jpg",
      "Names": {
         "English_Name": "Caribbean pine", 
         "Scientific_Name": "Pinus caribaea", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "thick, brown-grey, rough and flaking, resinous if cut.", 
         "Flower": "male and female flowers produced separately on the same tree. Male flowers on the upper part of branchlets, female on the lower part.", 
         "Fruit": "cones, greyish brown at maturity, about 8 cm long, each cone with a prominent spine.", 
         "Leaves": "needles, usually in threes, erect, flexible, dark green up to 21 cm long, usually less sharp pointed.", 
         "Seeds": "No. of seeds per kg: about 30,000. Germination sporadic, up to 6 weeks. Germination rate 35%."
      }, 
      "Propagation": "Seedlings", 
      "Remarks": "Seeds readily available. Matures within 20 years. Does not tolerate competition with indigenous trees. The timber is strong, moder- ately light weight and fairly durable, easy to season, saw and preserve. Mycorrhiza are necessary for seedling growth, so add soil from next to established trees. Both thinnings and pruned branches provide valuable fuel. In some countries the tree is used as pulp for the paper industry. ", 
      "Uses": [
         "Firewood", 
         "Timber", 
         "Plywood", 
         "Pulp", 
         "Fibreboard", 
         "Resin"
      ]
   }, 
   "eucalyptus": {
      "Description": "A tall tree to 55 m, rather narrow, the crown rounded and open, the main stems straight.", 
      "Ecology": "Grows naturally in the cooler and wetter parts of S.W. Australia. It prefers good-quality loams with adequate but not excessive moisture. The climatic range is transitional and wet montane. Suitable for areas over 2,000 m above sea level, and does well in upland areas of Kabale District.", 
      "ImageUri": "https://selectree.calpoly.edu/images/0500/43/original/eucalyptus-globulus-tree-2.jpg",
      "Names": {
         "English_Name": "Blue gum", 
         "Scientific_Name": "Eucalyptus globulus", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "blue-grey, smooth peeling in long strips, rough at base.", 
         "Flower": "buds grey-green wrinkled, 2.5 cm, usually one, rarely 2 or 3 white flowers to 4 cm across.", 
         "Fruit": "woody, half spheres, rough, 3 cm across, no stalks.", 
         "Leaves": "young leaves opposite, oval, blue-grey, without stalks and mature leaves deep blue- green, very long and thin to 30 cm, slightly curved, stalked, smelling of camphor if crushed, tip sharp.", 
         "Seeds": "No. of seeds per kg: 75,000-100,000. Seeds germinate in 4-15 days, at a rate of 35-80% with good seed."
      }, 
      "Propagation": "Seedlings, direct sowing at site", 
      "Remarks": "Young leaves of this species have been used to produce an oil used in pharmaceutical products. The tree is very susceptible to attack by beetles (Gonipterus scutellatus). The wood is hard, heavy and strong, the oil making it termite resistant. Therefore, it is often used for telegraph poles. Can be planted in pure stands, as an ornamental or as an avenue tree.", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Flooring", 
         "Veneer", 
         "Plywood", 
         "Medicine", 
         "Bee forage", 
         "Windbreak", 
         "Essential oils"
      ]
   }, 
   "indian-ash": {
      "Description": "A large tree reaching 60 m. The bole is often buttressed but then has a long straight trunk. It is an evergreen tree except in areas with a marked dry season.", 
      "Ecology": "Originally introduced in Uganda in arboretums, later planted throughout Uganda. It is most suitable for moderate altitudes with red soil and a moist climate, but can also stand some drought, 1,000-1,500 m.", 
      "ImageUri": "https://selectree.calpoly.edu/images/0100/29/original/acrocarpus-fraxinifolius-canopy.jpg",
      "Names": {
         "English_Name": "Indian ash", 
         "Scientific_Name": "Acrocarpus fraxinifolius", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "pale grey and smooth, trunk and branches bear leaf scars.", 
         "Flower": "appear on the tree when it is leafless, up to 20 dense heads hang down from branch ends, each 12 cm long, dripping nectar from the red-green flowers, short lived.", 
         "Fruit": "big bunches of dark brown pods persist on the tree. They split easily to release seed.", 
         "Leaves": "large, bipinnate in distinctive fan shapes to 1 m, young red leaves look like blossoms, leaflets oval, wavy and pointed to 14 cm.", 
         "Seeds": "No. of seeds per kg: 24,000-29,000. Germination is sporadic, 10-30 days after good pretreatment."
      }, 
      "Propagation": "Seedlings, direct sowing at site", 
      "Remarks": "It should not be planted near houses as dry branches drop off. Competes with crops if grown in fields. It grows extremely fast in Uganda, especially near Lake Victoria, where it was planted originally in Entebbe Botanic Gardens. (In Kenya it was used as a shade tree for coffee and tea.)", 
      "Uses": [
         "Firewood", 
         "Timber", 
         "Roof shingles", 
         "Beehives", 
         "Bee forage", 
         "Shade", 
         "Ornamental", 
         "Mulch", 
         "Windbreak"
      ]
   }, 
   "jacaranda": {
      "Description": "A deciduous tree up to 20 m with spreading branches making a light crown.", 
      "Ecology": "A popular tree widely grown as an ornamental throughout the high and lowland tropics. It grows in most soils except water- logged ones, and is deep rooted. It prefers highland areas but can also grow in some drier ones. It is common in most towns of Uganda, particularly Fort Portal, 1,100-1,600 m.", 
      "ImageUri": "https://cdn.shopify.com/s/files/1/0059/8835/2052/products/Jacaranda-Tree-450w_large.jpg?v=1555429237",
      "Names": {
         "English_Name": "Jacaranda", 
         "Scientific_Name": "Jacaranda mimosifolia", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "Pale grey and smooth, rough and peeling with age.", 
         "Flower": "Striking blue-violet, in clusters, each flower bell shaped to 4 cm, usually on the bare tree before leaf growth.", 
         "Fruit": "Rounded, woody capsules to 7 cm across with a wavy edge, brown-black when mature, splitting on the tree to set free many light winged seeds. Capsules may hang on the tree for 2 years. ", 
         "Leaves": "Bipinnate and feathery on a stalk to 40 cm, up to 30 pairs of- pinnae bearing the little pointed leaflets.", 
         "Seeds": "Seeds profusely. Germination rate 50-85 %. No. of seeds per kg: 63,000-80,000."
      }, 
      "Propagation": "Seedlings, coppicing, wildings", 
      "Remarks": null, 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Bee forage", 
         "Ornamental", 
         "Windbreak", 
         "Shade"
      ]
   }, 
   "jackfruit": {
      "Description": "A medium-sized tree with thick branches, to 25 m. The bole is short, cylindrical and straight, up to 1 m in diameter in old specimens, branching less than 2 m from the ground.", 
      "Ecology": "Originates from Asia, probably in the forests of the Western Ghats in India. Today it is widespread in other parts of the tropics and most popular in Sri Lanka. Introduced into Uganda in the early 1940s at Entebbe Botanic Garden, it has become very popular and is now commonly planted in Eastern, Central and Western Regions. Near Lake Victoria seeds germinate and young trees sprout spontaneously so that the species has become invasive in secondary vegetation. It requires well-drained, deep and fertile soils and will not tolerate drought or waterlogging.", 
      "ImageUri": "https://balconygardenweb-lhnfx0beomqvnhspx.netdna-ssl.com/wp-content/uploads/2015/07/growing-jackfruit.jpg",
      "Names": {
         "English_Name": "Jackfruit", 
         "Scientific_Name": "Artocarpus heterophyllus", 
         "Ugandan_Name": "Yakobo"
      }, 
      "Parts": {
         "Bark": "rough bark on the bole, grey but smooth on the branches.", 
         "Flower": "separate male and female, all very small but the female flowers have a stronger smell. The flowers are borne on the trunk or large branches where the fruit—the largest known—develops.", 
         "Fruit": "massive and irregular \"cauliflowery\", yellow-green compound fruit with a spiky rind, reaching a record 20 kg in weight and 1 m in length. The flesh is sweet and edible but definitely an acquired taste. Seeds, up to 5 cm, are edible when roasted.", 
         "Leaves": "glossy, oval to 15 cm long and 10 cm wide.", 
         "Seeds": "Seeds are hand picked individually from the fruit flesh after drying."
      }, 
      "Propagation": "Direct sowing at site, wildings", 
      "Remarks": "Suitable around compounds as a shade tree or support for climbing crops such as yams and passion fruit. Commonly intercropped with coffee and banana in Uganda. The fruit may be eaten in times of drought when other crops have failed. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Food", 
         "Medicine", 
         "Fodder", 
         "Shade", 
         "Gum"
      ]
   }, 
   "mango": {
      "Description": "A densely leafy evergreen tree with a trunk soon branching to a rounded crown, usually 10-15 m.", 
      "Ecology": "One of the most important tropical fruit trees brought very early to East Africa. In Uganda, it is widely cultivated in Northern and North Eastern Regions. It does not tolerate flooding and prefers sandy-loamy soil which is well drained, but it can do quite well in dry areas. Roots penetrate deeply, so rocky subsoil should be avoided. The extensive shallow roots collect water and nutrients in upper soil levels. Does well from 700 to 1,800 m.", 
      "ImageUri": "https://fateclick.com/images/article/20161229081140276.jpg",
      "Names": {
         "English_Name": "Mango", 
         "Scientific_Name": "Mangifera indica", 
         "Ugandan_Name": "Muyembe"
      }, 
      "Parts": {
         "Bark": "dark brown, cracking with age.", 
         "Flower": "numerous and small in pink-brown pyramidal heads. Pollination by flies and other insects.", 
         "Fruit": "fleshy, 8-15 cm, the skin green-red- yellow, the flattened \"stone\" is fibrous and woody around the large seed. ", 
         "Leaves": "dark green, crowded at the ends of branches, to 30 cm long, smelling of turpentine when crushed. Young leaves soft, copper-coloured and hanging limply.", 
         "Seeds": "Germination rate 60-90%. No. of seeds per kg: +50."
      }, 
      "Propagation": "Seedlings (sow seed in pots), direct sowing at site, grafting", 
      "Remarks": "Good varieties have fruits with a good flavour and little fibre. Relatively few flowers are pollinated, but even so up to 1,000 fruit develop on a mature tree. Each one has a large seed surrounded by golden juicy flesh, rich in vitamins A and C. Mango is an effective firebreak. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Food", 
         "Bee forage", 
         "Ornamental", 
         "Shade", 
         "Windbreak", 
         "Soil conservation", 
         "Gum"
      ]
   }, 
   "mexican-cypress": {
      "Description": "An evergreen tree to 35 m with straight trunk, generally conical but irregular in shape, the branches hang down with branchlets in all directions.", 
      "Ecology": "A fast-growing tree widely used in East and Southern Africa and grown in plantations in many areas; introduced to Uganda, 1,100-3,000 m. At higher altitudes the tree tends to be invasive.", 
      "ImageUri": "https://bugwoodcloud.org/images/768x512/1603820.jpg",
      "Names": {
         "English_Name": "Mexican cypress", 
         "Scientific_Name": "Cupressus lusitanica", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "red-brown with vertical grooves, grey with age.", 
         "Flower": null, 
         "Fruit": "male cones like fat tips to branchlets, producing clouds of yellow pollen dust; female cones ripen in two years, rounded, 1.5 cm across, brown, the cone scales with central, pointed projections. About 75 winged seeds are released from beneath the cone scales. ", 
         "Leaves": null, 
         "Seeds": "No. of seeds per kg: 160,000-290,000. Germination of good seed 30-40% in 10-20 days."
      }, 
      "Propagation": "Seedlings, wildings", 
      "Remarks": "Can produce poles after 10 years, general purpose timber after 20 years. Not good for intercropping. From 1990 severely attacked by the cypress aphid: branches turn yellow, later dry out. However, some trees have recovered better than others possibly indicating genetic differences. In Uganda, this menace seems to have been less severe than in some neighbouring countries.", 
      "Uses": [
         "Firewood", 
         "Poles", 
         "Posts", 
         "Timber", 
         "Ornamen- tal", 
         "Shade", 
         "Windbreak", 
         "Live fence"
      ]
   }, 
   "mpewere": {
      "Description": "A very large deciduous tree to 50 m, branching relatively low down to give feathery layered foliage. Trunk often leaning or wavy to a wide flat crown. There are large thin buttresses extending 3-5 m up the bole. They may extend outwards like curved planks to 30 cm high radiating out to 5 m along the forest floor.", 
      "Ecology": "A tall tree of tropical lowland rain forest and riverine forest from Senegal, Sudan to Angola and Zaire. In Uganda it is a common and very characteristic species of the forests of the Lake Victoria belt, riparian in habit.", 
      "ImageUri": "http://tropical.theferns.info/plantimages/sized/3/c/3c163fda5a72619137d999790af2c852d242e345_480px.jpg",
      "Names": {
         "English_Name": null, 
         "Scientific_Name": "Piptadeniastrum africanum", 
         "Ugandan_Name": "Mpewere"
      }, 
      "Parts": {
         "Bark": "yellow-grey-brown, thin and smooth with ring marks and numerous very small lenticel dots. Bark on buttresses may have red-brown upper edges; when cut the slash is dry and pale yellow (resin in Newtonia). Young branchlets densely brown hairy.", 
         "Flower": "yellow-white, fading orange-brown, on branched spikes each one 4-11 cm with a hairy brown stalk. Each tiny flower has a cup-like calyx, 5 petals and 10 longer stamens. Flowering is irregular but dense masses of flowers appear on upper branches.", 
         "Fruit": "flat pods, dark brown, 17-36 cm long, about 2.5 cm wide, split open on one side only to release seed while still on the tree. Seeds lie transversely in the pod (unlike Newtonia), each one flat and 5-9 cm long, brown and oblong, surrounded by a membranous wing. ", 
         "Leaves": "bipinnate with 10-19 pairs of pinnae which are usually alternate (not opposite as in Newtonia), very many tiny narrow leaflets to 8 mm long, slightly curved. No glands on leaf stalk (contrast Newtonia).", 
         "Seeds": "On dehiscing, the winged seeds are blown away from the mother tree. Seed must be collected by searching throughout the forest until the required amount is collected,"
      }, 
      "Propagation": "Wildings, seedlings", 
      "Remarks": "The timber has been used in Kenya for cabinet work, sleepers and wagon building. The species has been successfully tried in plantations by the Uganda Forest Department. It is also suitable as a shade tree in banana, coffee and cocoa plantations. Many fine specimens can be seen in the Entebbe Botanic Gardens. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Shade"
      ]
   }, 
   "musizi": {
      "Description": "A leafy semi-deciduous tree 10-30 m, often a clear bole to 10 m, the branches rather horizontal, the crown flattened when young but more rounded with age.", 
      "Ecology": null, 
      "ImageUri": "https://keys.lucidcentral.org/keys/v3/eafrinet/weeds/key/weeds/Media/Html/images/Maesopsis_eminii_(Umbrella_Tree)/maesopsis_eminii001.jpg",
      "Names": {
         "English_Name": null, 
         "Scientific_Name": "Maesopsis eminii", 
         "Ugandan_Name": "Musizi"
      }, 
      "Parts": {
         "Bark": "pale grey- brown, branchlets dotted with breathing pores, grooved with age.", 
         "Flower": "small and green in heads beside leaves.", 
         "Fruit": "oval, to 3 cm long, fleshy and yellow, turning purple, with 1-2 hard seeds.", 
         "Leaves": "appear compound but alternate on the twig, on stalks to 1 cm, each long and shiny, pointed, to 14 cm, the edge with characteristic well- spaced rounded teeth.", 
         "Seeds": "No. of seeds per kg: 500. Low germination rate (20-55%)."
      }, 
      "Propagation": "Seedlings (sow seed in pots), wildings, direct sowing at site", 
      "Remarks": "One of the quickest growing timber trees, maturing in 20 years. It is grown in pure stands, as an avenue tree and also intercropped with banana, coffee and cocoa. The timber is not resistant to fungi or termites so rots quickly. Hornbills and chimpanzees eat the fruit and disperse the seed. ", 
      "Uses": [
         "Firewood", 
         "Charcoal", 
         "Timber", 
         "Poles", 
         "Veneer/plywood", 
         "Fodder", 
         "Shade", 
         "Ornamental"
      ]
   }, 
   "orange": {
      "Description": null, 
      "Ecology": "Sweet orange is a native of southern China or Cochin China. It is now grown widely throughout the tropics and subtropics but is no longer known in the wild. Orange trees produce more fruit with irrigation.", 
      "ImageUri": "http://www.freshplaza.com/2017/Sitrus.JPG",
      "Names": {
         "English_Name": "Orange", 
         "Scientific_Name": "Citrus sinensis", 
         "Ugandan_Name": "Muchungwa"
      }, 
      "Parts": {
         "Bark": null, 
         "Flower": "very fragrant, one or many in leaf axils, 2-3 cm across, 5 white petals, 20-25 stamens in groups.", 
         "Fruit": "rather variable in colour and shape, rounded green-yellow-orange, 4-12 cm across, the relatively thin skin hard to remove, the pulp surrounding the seeds sweet-sour but juicy. ", 
         "Leaves": "oval, 5-15 cm x 2-8 cm, shiny dark green above, the stalk narrowly winged, having a line or break with the leaf blade (articulation).", 
         "Seeds": null
      }, 
      "Propagation": "Seedlings, wildings, grafting", 
      "Remarks": "Sweet orange does not do well in high-rainfall areas. Farmers have been discouraged because of the diseases which attack sweet orange. The sweet orange is the most widely grown and economi- cally important of all citrus species in the world. ", 
      "Uses": [
         "Firewood", 
         "Food", 
         "Juice", 
         "Oil"
      ]
   }, 
   "pawpaw": {
      "Description": "A tree-like herb, 2-10 m, the trunk about 20 cm across, narrowing to a crown of leaves. Stem suckers often develop but branching only when the terminal bud is damaged. The trunk contains soft fibrous wood.", 
      "Ecology": "A short-lived tree grown throughout the subtropics in Africa, Australia and North America. It does better below 1,500 m in soils that are well drained, fertile and slightly acid (pH 6.0-6.5). It has shallow roots. In some areas it sprouts spontaneously after clearing secondary scrub and old cultivation.", 
      "ImageUri": "https://media.gardenmaking.com/wp-content/uploads/20190203095039/pawpawtreeomafra.jpg",
      "Names": {
         "English_Name": "Pawpaw", 
         "Scientific_Name": "Carica papaya", 
         "Ugandan_Name": "Papaali"
      }, 
      "Parts": {
         "Bark": "pale grey, smooth, well marked with leaf scars.", 
         "Flower": "male trees abundant flowers on drooping stalks, each cream-yellow, about 2 cm long, tubular, and fragrant; female trees larger, few flowers beside leaves, 5 thick waxy petals, cream, about 5 cm long, fragrant with prominent sticky stigma (some- times male and female together on one tree).", 
         "Fruit": "take about 3 months to mature, oblong to spherical, 7-50 cm x 15 cm, thin skin, green to orange. The sweet edible flesh bears many black seed on the inside leaving the centre hollow. ", 
         "Leaves": "large, up to 60 cm across, deeply palmately lobed, the hollow stalks to 60 cm long, swollen at the base.", 
         "Seeds": "No. of seed per kg: 20,000. Collected from ripe fruit and air dry. "
      }, 
      "Propagation": "Seedlings, direct sowing on site at predetermined spacing in prepared spots and later thinned out leaving one seedling at each spot", 
      "Remarks": "Pawpaw is strongly recommended as a household tree for all parts of Uganda below 1,500 m. Meat can be tenderized by wrapping it in pawpaw leaves. Harvest fruit when a yellow colour begins to appear. Trees do well for 3-4 years then yield falls, so plant every 4 years on a fresh site. Pawpaw is attacked by several insects. Leaves used to treat whooping cough. ", 
      "Uses": [
         "Food", 
         "Drink", 
         "Medicine", 
         "Pickles", 
         "Jam", 
         "Meat tenderizing"
      ]
   }, 
   "terminalia": {
      "Description": "A shapely tree to about 10 m, with leafy horizontal branches.", 
      "Ecology": "A tree from Madagascar, now very popular in East Africa, especially Kenya. It has recently been introduced to Uganda and has gained popularity as an ornamental. It has been planted around Parliament buildings and along some streets in Kampala. It grows well in good soil and is drought resistant once estab- lished. Since the tree rarely flowers at high altitudes, seed is collected from trees in hotter low areas.", 
      "ImageUri": "http://tropical.theferns.info/plantimages/sized/0/4/04215add5085f18c6e80caec7492ffd040ba6341_960px.jpg",
      "Names": {
         "English_Name": "Terminalia", 
         "Scientific_Name": "Terminalia mantaly", 
         "Ugandan_Name": null
      }, 
      "Parts": {
         "Bark": "pale, grey, smooth.", 
         "Flower": "small, green in erect spikes to 5 cm long.", 
         "Fruit": "small green and oval to 1.5 cm with no obvious wings.", 
         "Leaves": "in terminal rosettes of 4-9 unequal leaves on short thickened stalks, up to 7 cm, tip rounded, edge wavy, bright green when young.", 
         "Seeds": "Easily collected."
      }, 
      "Propagation": "Seedlings", 
      "Remarks": "Seedlings of this species fetch good prices.", 
      "Uses": [
         "Shade", 
         "Ornamental"
      ]
   }
}